MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_ccb.c
/** @defgroup CCB_Configuration_Table CCB Configuration Table
  * @{

# Configuration inside the CCB driver

Config defines               | Description           | Default value     | Note
-----------------------------| ----------------------| ------------------| ----------------------------------------
PRODUCT                      | from IDE              | NA                | Ex:STM32C5XXxx.
USE_ASSERT_DBG_PARAM         | from IDE              | None              | Enable the parameters asserts.
USE_ASSERT_DBG_STATE         | from IDE              | None              | Enable the state asserts.
USE_HAL_CHECK_PARAM          | from hal_conf.h       | 0U                | Parameters runtime check.
USE_HAL_SECURE_CHECK_PARAM   | from hal_conf.h       | 0U                | Parameters runtime check for sensitive APIs.
USE_HAL_CCB_MODULE           | from hal_conf.h       | 1U                | Enable the HAL CCB module.
USE_HAL_CCB_CLK_ENABLE_MODEL | from hal_conf.h       | HAL_CLK_ENABLE_NO | Enable the HAL_CCB_CLK.
USE_HAL_CCB_GET_LAST_ERRORS  | from hal_conf.h       | 0U                | Allows retrieving the last error codes.
USE_HAL_CCB_USER_DATA        | from hal_conf.h       | 0U                | Allows enabling or disabling user data.
  */
/**
  * @}
  */

/* Private constants--------------------------------------------------------------------------------------------------*/
/** @defgroup CCB_Private_Constants CCB Private Constants
  * @{
  */
/*! CCB_PKA_Mode CCB PKA mode */
#define CCB_PKA_MODULAR_EXP_PROTECT_MODE      (PKA_CR_MODE_0 | PKA_CR_MODE_1) /*!< Modular exponentiation protected
                                                                                   mode                               */
#define CCB_PKA_ECC_MUL_PROTECT_MODE          (PKA_CR_MODE_5)                 /*!< ECC scalar multiplication protected
                                                                                   mode                               */
#define CCB_PKA_ECDSA_SIGNATURE_PROTECT_MODE  (PKA_CR_MODE_5 | PKA_CR_MODE_2) /*!< ECDSA signature protected mode     */
#define CCB_PKA_ECDSA_VERIFICATION_MODE       (PKA_CR_MODE_5 | PKA_CR_MODE_2 | PKA_CR_MODE_1) /*!< ECDSA verification */

/*! CCB_PKA_RAM_SIZE CCB PKA RAM size */
#define CCB_PKA_RAM_SIZE                     (0x00000536U)  /*!< CCB PKA RAM size */

/*! CCB_Operations CCB Operations */
#define CCB_ECDSA_SIGN_CPU_BLOB_CREATION     (0x000000C0U)  /*!< ECDSA signature blob creation with private key
                                                                 from the CPU                                   */
#define CCB_ECDSA_SIGN_RNG_BLOB_CREATION     (0x000000C2U)  /*!< ECDSA signature blob creation with private key
                                                                 from the RNG                                   */
#define CCB_ECDSA_SIGN_BLOB_USE              (0x000000C3U)  /*!< ECDSA signature blob usage for ECDSA signature   */
#define CCB_ECC_SCALAR_MUL_CPU_BLOB_CREATION (0x00000080U)  /*!< ECC scalar multiplication blob creation with
                                                                 private key from the CPU                       */
#define CCB_ECC_SCALAR_MUL_RNG_BLOB_CREATION (0x00000082U)  /*!< ECC scalar multiplication blob creation with
                                                                 private key from the RNG                       */
#define CCB_ECC_SCALAR_MUL_BLOB_USE          (0x00000081U)  /*!< ECC Scalar multiplication blob use, or ECDSA
                                                                 signature blob use for public key computation  */
#define CCB_MODULAR_EXP_CPU_BLOB_CREATION    (0x00000044U)  /*!< Modular exponentiation blob creation with priv
                                                                 key from the CPU                               */
#define CCB_MODULAR_EXP_BLOB_USE             (0x00000045U)  /*!< Modular exponentiation blob usage                */

/*! CCB_PKA_Result CCB PKA result */
#define CCB_PKA_RESULT_OK                    (0x0000D60DU)  /*!< PKA operation result is OK and no PKA Hardware
                                                                 operation error                               */

/*! CCB several values */
#define CCB_FAKE_VALUE               (0x0001UL)        /*!< Fake value used for SAES_IVRs                             */
#define CCB_MAGIC_VALUE              (0x0CCBUL)        /*!< Magic number used when chaining key from SAES to PKA RAM  */
#define CCB_IV0_VALUE                (0x0002UL)        /*!< SAES_IVR0 that must be equal to 0x2                       */
#define CCB_BLOCK_SIZE_WORD          (0x0004UL)        /*!< Block size is 128 bits (4*32 bits)                        */
#define CCB_SYMMETRIC_KEY_SIZE_WORD  (0x0008UL)        /*!< Symmetric key size is always 256 (8*32 bits)              */

/*! CCB Timeout Values */
#define CCB_GENERAL_TIMEOUT_MS      0x1000U          /*!< General CCB operation timeout in milliseconds */

#if defined (USE_HAL_CCB_RNG_RECOVERY) && (USE_HAL_CCB_RNG_RECOVERY == 1U)
#if defined(RNG_HTSR0_RPERRX) || defined(RNG_HTSR1_ADERRX)
#define CCB_RNG_TIMEOUT_VALUE       0x00000002U      /*!< RNG timeout value in milliseconds */
#endif /* RNG_HTSR0_RPERRX || RNG_HTSR1_ADERRX */
#endif /* CCB_RNG_TIMEOUT_VALUE */

/*! Number of bytes in one 32-bit word */
#define CCB_BYTES_PER_WORD    4U

/*! Number of 32-bit words in one block */
#define CCB_WORDS_PER_BLOCK   2U

/*! CCB key type */
#define CCB_KEY_TYPE_SOFTWARE 0U  /*!< CCB key type software */
#define CCB_KEY_TYPE_HARDWARE 1U  /*!< CCB key type hardware */
/**
  * @}
  */

/* Private types--------------------------------------------------------------------------------------------------*/
/** @defgroup CCB_Private_Types CCB Private Types
  * @{
  */

/*! CCB software unwrap key context struct */
typedef struct
{
  uint32_t ccb_key_type;                                            /*!< CCB key type */
  const hal_ccb_wrapping_sw_key_context_t *p_wrapping_key_context;  /*!< Pointer to the software key context */
  const uint32_t *p_in_wrapped_user_key;                            /*!< Pointer to the wrapped user key */
} ccb_sw_unwrap_key_context_t;

/*! CCB hardware unwrap key context struct */
typedef struct
{
  uint32_t ccb_key_type;                                   /*!< CCB key type */
  hal_ccb_wrapping_hw_key_type_t wrapping_key_context;     /*!< wrapping key context, can be a value
                                                                of @ref hal_ccb_wrapping_hw_key_type_t */
} ccb_hw_unwrap_key_context_t;
/**
  * @}
  */

/* Private macros ----------------------------------------------------------------------------------------------------*/
/** @defgroup CCB_Private_Macros CCB Private Macros
  * @{
  */
/*! Macro to get the handle instance */
#define CCB_GET_INSTANCE(handle) ((CCB_TypeDef *)((uint32_t)(handle)->instance))

/*! Macro to get PKA flag */
#define CCB_GET_PKA_FLAG(pka_instance, flag)              (((((pka_instance)->SR) & (flag)) == (flag)) ? 1U : 0U)

/*! Macro to clear PKA flag */
#define CCB_CLEAR_PKA_FLAG(pka_instance, flag)            STM32_WRITE_REG(((pka_instance)->CLRFR), (flag))

/*! Macro to check the AES chaining mode */
#define IS_CCB_AES_MODE(aes_algorithm) (((aes_algorithm) == HAL_CCB_AES_ECB) \
                                        || ((aes_algorithm) == HAL_CCB_AES_CBC))

/*! Macro to check the hardware key type */
#define IS_CCB_HW_KEY_TYPE(key_type) (((key_type) == AES_CR_KEYSEL_0) \
                                      || ((key_type) == AES_CR_KEYSEL_2))

/*! Macro to access a 32-bit word in the PKA RAM */
#define CCB_PKA_RAM_WORD_ACCESS(pka_instance, idx) (*(volatile uint32_t *)(uint32_t) \
                                                    & ((PKA_TypeDef *)pka_instance)->RAM[idx * sizeof(uint32_t)])

/*! Macro to check the provided CCB ECDSA pool buffer size */
#define IS_CCB_ECDSA_POOL_BUFFER_SIZE(buff_size_byte, modulus_size) (((buff_size_byte) \
                                                                      >= HAL_CCB_ECDSA_CALC_BUFFER_SIZE(modulus_size)))

/*! Macro to check the provided CCB ECC pool buffer size */
#define IS_CCB_ECC_POOL_BUFFER_SIZE(buff_size_byte, modulus_size) (((buff_size_byte) \
                                                                    >= HAL_CCB_ECC_CALC_BUFFER_SIZE(modulus_size)))

