MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_ccb.c
/*! Macro to check the provided CCB RSA pool buffer size */
#define IS_CCB_RSA_POOL_BUFFER_SIZE(buff_size_byte, modulus_size) (((buff_size_byte) \
                                                                    >= HAL_CCB_RSA_CALC_BUFFER_SIZE(modulus_size)))
/**
  * @}
  */

/* private function prototypes --------------------------------------------------------------------------------------*/
/** @defgroup CCB_Private_Functions CCB Private Functions
  * @{
  */
/* Initialization private function */
static hal_status_t CCB_PKA_Init(PKA_TypeDef *p_pka_instance);
static hal_status_t CCB_RNG_Init(RNG_TypeDef *p_rng_instance);

/* Software reset private function */
static void CCB_RESET(const hal_ccb_handle_t *hccb);

/* Polling private function */
static hal_status_t CCB_WaitOperStep(CCB_TypeDef const *p_ccb_instance, uint32_t step);
static hal_status_t CCB_WaitFLAG(CCB_TypeDef const *p_ccb_instance, uint32_t flag);
static hal_status_t CCB_PKA_WaitFlag(PKA_TypeDef *p_pka_instance, uint32_t flag);
static hal_status_t CCB_RNG_WaitFlag(RNG_TypeDef *p_rng_instance, uint32_t flag);
static hal_status_t CCB_SAES_WaitFlag(AES_TypeDef *p_saes_instance, uint32_t flag, uint32_t status);

/* Set parameters private function */
static hal_status_t CCB_ECDSASign_SetParam(const hal_ccb_ecdsa_curve_param_t *p_in_curve_param);
static hal_status_t CCB_ECCMul_SetParam(const hal_ccb_ecc_mul_curve_param_t *p_in_curve_param);
static hal_status_t CCB_RSAModExp_SetParam(const hal_ccb_rsa_param_t *p_in_curve_param);
static hal_status_t CCB_SetParam(uint32_t modulus_size_byte, uint32_t dst_address, const uint8_t *p_src);

/* Wrapping key private function */
static hal_status_t CCB_Wrapping_Key_Config(void *p_unwrapkey_context, uint8_t ccb_operation);

static hal_status_t CCB_WrapSymmetricKey(CCB_TypeDef *p_ccb_instance, const uint32_t *p_in_clear_user_key,
                                         uint32_t operation,
                                         const hal_ccb_wrapping_sw_key_context_t *p_wrapping_key_context,
                                         uint32_t *p_out_wrapped_user_key);

/* Data management private function */
static uint32_t CCB_GetOptBitSize_u8(uint32_t byte_number, uint8_t msb);
static void CCB_Memcpy_u32_to_u8(volatile uint8_t *p_dst, const volatile uint32_t *p_src, size_t size);
static void CCB_Memcpy_u8_to_u32(volatile uint32_t *p_dst, const volatile  uint8_t *p_src, size_t size);
static void CCB_Memcpy_u32_to_u32(volatile uint32_t *p_dst, const volatile uint32_t *p_src, size_t size);
static void CCB_Memcpy_u8_to_u64(volatile uint32_t *p_dst, const volatile uint8_t *p_src);
static void CCB_Memcpy_TailBytesToU64(volatile uint32_t *p_dst, const volatile uint8_t *p_src, size_t size);

/* Blob processing private function */
static hal_status_t CCB_BlobCreation_InitialPhase(uint32_t *p_iv, uint32_t randoms);
static hal_status_t CCB_BlobUse_InitialPhase(CCB_TypeDef *p_ccb_instance, const uint32_t *p_iv, uint32_t *p_tag,
                                             uint32_t randoms);
static hal_status_t CCB_BlobCreation_FinalPhase(uint32_t operation, uint32_t *p_tag, uint32_t size_param,
                                                uint32_t randoms);
static hal_status_t CCB_BlobUse_FinalPhase(AES_TypeDef *p_saes_instance, uint32_t operation,
                                           uint32_t size_param);
static hal_status_t CCB_ECDSA_SignBlobCreation(CCB_TypeDef *p_ccb_instance,
                                               const hal_ccb_ecdsa_curve_param_t *p_in_curve_param,
                                               void *p_unwrapkey_context, const uint8_t *p_clear_private_key,
                                               uint32_t *p_iv, uint32_t *p_tag, uint32_t *p_wrapped_key,
                                               uint32_t randoms, uint8_t *p_hash, hal_ccb_ecdsa_sign_t *p_signature,
                                               uint8_t ccb_operation);
static hal_status_t CCB_ECDSA_ComputePublicKey(CCB_TypeDef *p_ccb_instance,
                                               const hal_ccb_ecdsa_curve_param_t *p_in_curve_param,
                                               void *p_unwrapkey_context, uint32_t *p_iv, uint32_t *p_tag,
                                               uint32_t *p_wrapped_key, uint32_t randoms,
                                               hal_ccb_ecc_point_t *p_output_point);
static hal_status_t CCB_ECDSA_Sign(CCB_TypeDef *p_ccb_instance, const hal_ccb_ecdsa_curve_param_t *p_in_curve_param,
                                   void *p_unwrapkey_context, hal_ccb_ecdsa_key_blob_t *p_in_ecdsa_key_blob,
                                   const uint8_t *p_in_hash, uint8_t hash_size, hal_ccb_ecdsa_sign_t *p_out_signature);
static hal_status_t CCB_ECC_ScalarMulBlobCreation(CCB_TypeDef *p_ccb_instance,
                                                  const hal_ccb_ecc_mul_curve_param_t *p_in_curve_param,
                                                  void *p_unwrapkey_context, const uint8_t *p_clear_private_key,
                                                  uint32_t *p_iv, uint32_t *p_tag, uint32_t *p_wrapped_key,
                                                  uint32_t randoms, uint32_t *scalar_mul_x_ref,
                                                  uint32_t *scalar_mul_y_ref, uint8_t ccb_operation);
static hal_status_t CCB_RSA_ExpBlobCreation(CCB_TypeDef *p_ccb_instance, const hal_ccb_rsa_param_t *p_param,
                                            void *p_unwrapkey_context,
                                            const hal_ccb_rsa_clear_key_t *p_rsa_clear_private_key,
                                            uint32_t *p_iv, uint32_t *p_tag, uint32_t *p_wrapped_exp,
                                            uint32_t *p_wrapped_phi, uint32_t randoms, uint8_t *p_operand,
                                            uint32_t *p_reference_modular_exp);
static hal_status_t CCB_ECC_ComputeScalarMul(CCB_TypeDef *p_ccb_instance,
                                             const hal_ccb_ecc_mul_curve_param_t *p_in_curve_param,
                                             void *p_unwrapkey_context, uint32_t *p_iv, uint32_t *p_tag,
                                             uint32_t *p_wrapped_key, uint32_t randoms,
                                             const hal_ccb_ecc_point_t *p_input_point,
                                             hal_ccb_ecc_point_t *p_output_point);
static hal_status_t CCB_RSA_ComputeModularExp(CCB_TypeDef *p_ccb_instance, const hal_ccb_rsa_param_t *p_param,
                                              void *p_unwrapkey_context, uint32_t *p_iv, uint32_t *p_tag,
                                              uint32_t *p_wrapped_exp, uint32_t *p_wrapped_phi, uint32_t randoms,
                                              const uint8_t *p_operand, uint8_t *p_modular_exp);
static hal_status_t CCB_PKA_ECDSASetConfigVerifSignature(PKA_TypeDef *p_pka_instance,
                                                         const hal_ccb_ecdsa_curve_param_t *p_in_curve_param,
                                                         hal_ccb_ecc_point_t *p_public_key_out, const uint8_t *p_hash,
                                                         hal_ccb_ecdsa_sign_t *p_signature);
static hal_status_t CCB_PKA_SetOperation(PKA_TypeDef *p_pka_instance, uint32_t operation);
static hal_status_t CCB_SAES_SW_UnwrapKey(AES_TypeDef *p_saes_instance, const void *p_unwrapkey_context);
static hal_status_t CCB_RNG_GenerateRandomNumbers(RNG_TypeDef *p_rng_instance, uint16_t *p_randoms);
static hal_status_t CCB_RNG_GenerateHashMessage(RNG_TypeDef *p_rng_instance, uint8_t *p_hash, uint32_t hash_size);
static inline void CCB_PKA_PadEndRam(volatile uint32_t *p_pka_ram, uint32_t index);
static inline uint32_t CCB_SAES_GetFlag(AES_TypeDef const *p_saes_instance, uint32_t flag);
static inline void CCB_PKA_WriteClearTextData(volatile uint32_t *p_pka_ram, uint16_t dst_address, const uint8_t *p_src,
                                              uint32_t modulus_size_byte, uint32_t operand_size);
static inline hal_status_t CCB_WriteWrappedKey(uint16_t dst_address, const uint32_t *p_wrapped_key, uint32_t size_byte,
                                               uint32_t randoms);
static inline hal_status_t CCB_WriteKeyFromRNG(uint16_t dst_address, uint32_t operand_size);
static inline hal_status_t CCB_ReadCipheredPrivateKey(uint16_t dst_address, uint32_t operand_size,
                                                      uint32_t *p_wrapped_key, uint32_t randoms);

/* Pool buffer erase private function */
static void CCB_ErasePoolBuffer(uint8_t *p_buff, uint32_t buff_size_byte);

#if defined (USE_HAL_CCB_RNG_RECOVERY) && (USE_HAL_CCB_RNG_RECOVERY == 1U)
#if defined(RNG_HTSR0_RPERRX) || defined(RNG_HTSR1_ADERRX)
hal_status_t CCB_RNG_ResilientRecoverSeedError(void);
#endif /* RNG_HTSR0_RPERRX || RNG_HTSR1_ADERRX */
#endif /* USE_HAL_CCB_RNG_RECOVERY */
/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @addtogroup CCB_Exported_Functions
  * @{
  */

/** @addtogroup CCB_Exported_Functions_Group1
  * @{
This subsection provides a set of functions to initialize and de-initialize the CCB peripheral:
- The HAL_CCB_Init() API: Allows initializing the HAL CCB driver so it can be used for blob creation or usage.
  This API is the first API to call when using the HAL CCB, it takes 2 parameters as input:
 - The HAL CCB handle: A pointer to a @ref hal_ccb_handle_t structure
 - The CCB instance  : A value from the enumeration  @ref hal_ccb_t
- The HAL_CCB_DeInit() API: Allows de-initializing the HAL CCB driver by:
   - Disabling the CCB peripheral
   - De-initializing the current handle object
   - Resetting the handle global state to the **HAL_CCB_STATE_RESET**
  */

/**
  * @brief  Initialize the HAL CCB handle and associate it to an instance.
  * @param  hccb              Pointer to a @ref hal_ccb_handle_t structure
  * @param  instance          @ref hal_ccb_t enumerated type variable to be set according to the physical instance
  * @retval HAL_INVALID_PARAM Invalid param return when the CCB handle is NULL
  * @retval HAL_OK            The HAL CCB driver is initialized according to the given handle and instance
  */
hal_status_t HAL_CCB_Init(hal_ccb_handle_t *hccb, hal_ccb_t instance)
{
  ASSERT_DBG_PARAM(hccb != NULL);
  ASSERT_DBG_PARAM((IS_CCB_ALL_INSTANCE((CCB_TypeDef *)(uint32_t)instance)));

