MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_ccb.c
#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
       || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if (hccb == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

  hccb->instance = instance;

#if defined(USE_HAL_CCB_USER_DATA) && (USE_HAL_CCB_USER_DATA == 1)
  hccb->p_user_data = NULL;
#endif /* (USE_HAL_CCB_USER_DATA) */

#if defined(USE_HAL_CCB_GET_LAST_ERRORS) && (USE_HAL_CCB_GET_LAST_ERRORS == 1)
  hccb->last_error_codes = HAL_CCB_ERROR_NONE;
#endif /* USE_HAL_CCB_GET_LAST_ERRORS */

#if defined(USE_HAL_CCB_CLK_ENABLE_MODEL) && (USE_HAL_CCB_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO)
  HAL_RCC_CCB_EnableClock();
  HAL_RCC_RNG_EnableClock();
  HAL_RCC_PKA_EnableClock();
  HAL_RCC_SAES_EnableClock();
#endif /* USE_HAL_CCB_CLK_ENABLE_MODEL */

  hccb->global_state = HAL_CCB_STATE_IDLE;
  return HAL_OK;
}

/**
  * @brief  De-initialize the CCB peripheral.
  * @param  hccb Pointer to a @ref hal_ccb_handle_t structure
  */
void HAL_CCB_DeInit(hal_ccb_handle_t *hccb)
{
  ASSERT_DBG_PARAM(hccb != NULL);
  ASSERT_DBG_PARAM((IS_CCB_ALL_INSTANCE((CCB_TypeDef *)(uint32_t)hccb->instance)));

  CCB_RESET(hccb);

  hccb->global_state = HAL_CCB_STATE_RESET;
}

/**
  * @}
  */

/** @addtogroup CCB_Exported_Functions_Group2
  * @{
This subsection provides a CCB Reset API :
- HAL_CCB_Reset() allows either aborting an ongoing CCB operation or recovering from an unrecoverable error by
  resetting all related peripherals including CCB, SAES, PKA and RNG.
  */

/**
  * @brief Reset the ongoing operation and clear stored SAES and PKA data.
  * @param  hccb              Pointer to a @ref hal_ccb_handle_t.
  */
void HAL_CCB_Reset(hal_ccb_handle_t *hccb)
{
  ASSERT_DBG_PARAM(hccb != NULL);
  ASSERT_DBG_STATE(hccb->global_state, (uint32_t)HAL_CCB_STATE_ACTIVE | (uint32_t)HAL_CCB_STATE_FAULT);

  CCB_RESET(hccb);

  hccb->global_state = HAL_CCB_STATE_IDLE;
}
/**
  * @}
  */

/** @addtogroup CCB_Exported_Functions_Group3
  * @{
This subsection provides a set of functions to wrap the clear symmetric key:

- HAL_CCB_ECDSA_WrapSymmetricKey(): Allows wrapping the clear symmetric key for ECDSA operations.
- HAL_CCB_ECC_WrapSymmetricKey(): Allows wrapping the clear symmetric key for ECC operations.
- HAL_CCB_RSA_WrapSymmetricKey(): Allows wrapping the clear symmetric key for RSA operations.
  */

/**
  * @brief  Wrap the clear symmetric key for ECDSA operations.
  * @param  hccb                      Pointer to a @ref hal_ccb_handle_t structure
  * @param  p_in_user_key             Pointer to the clear AES key
  * @param  p_wrapping_key_context    Pointer to a @ref hal_ccb_wrapping_sw_key_context_t structure
  * @param  p_out_wrapped_user_key    Pointer to the wrapped user key
  * @retval HAL_INVALID_PARAM         The function return an Invalid param in the following cases: \n
  *                                   - The CCB handle is NULL \n
  *                                   - Input user key pointer is NULL \n
  *                                   - Wrapping key context pointer is NULL \n
  *                                   - Output wrapped user key pointer is NULL \n
  * @retval HAL_ERROR                 Error detected
  * @retval HAL_OK                    Operation completed successfully
  */
hal_status_t HAL_CCB_ECDSA_WrapSymmetricKey(hal_ccb_handle_t *hccb, const uint32_t *p_in_user_key,
                                            hal_ccb_wrapping_sw_key_context_t *p_wrapping_key_context,
                                            uint32_t *p_out_wrapped_user_key)
{
  CCB_TypeDef *p_ccb_instance = NULL;

  ASSERT_DBG_PARAM(hccb != NULL);
  ASSERT_DBG_PARAM(p_in_user_key != NULL);
  ASSERT_DBG_PARAM(p_wrapping_key_context != NULL);
  ASSERT_DBG_PARAM(IS_CCB_AES_MODE(p_wrapping_key_context->aes_algorithm));
  ASSERT_DBG_PARAM(p_wrapping_key_context->p_init_vect != NULL);
  ASSERT_DBG_PARAM(p_wrapping_key_context->key_size != 0U);
  ASSERT_DBG_PARAM(p_out_wrapped_user_key != NULL);

  ASSERT_DBG_STATE(hccb->global_state, (uint32_t)HAL_CCB_STATE_IDLE);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hccb == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
|| (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if ((p_in_user_key == NULL) || (p_wrapping_key_context == NULL) || (p_wrapping_key_context->p_init_vect == NULL)
      || (p_wrapping_key_context->key_size == 0U) || (p_out_wrapped_user_key == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hccb, global_state, HAL_CCB_STATE_IDLE, HAL_CCB_STATE_ACTIVE);

  CCB_RESET(hccb);

#if defined(USE_HAL_CCB_GET_LAST_ERRORS) && (USE_HAL_CCB_GET_LAST_ERRORS == 1)
  hccb->last_error_codes = HAL_CCB_ERROR_NONE;
#endif /* USE_HAL_CCB_GET_LAST_ERRORS */

  p_ccb_instance = CCB_GET_INSTANCE(hccb);

  if (CCB_WrapSymmetricKey(p_ccb_instance, p_in_user_key, CCB_ECDSA_SIGN_CPU_BLOB_CREATION,
                           p_wrapping_key_context, p_out_wrapped_user_key) != HAL_OK)
  {
#if defined(USE_HAL_CCB_GET_LAST_ERRORS) && (USE_HAL_CCB_GET_LAST_ERRORS == 1)
    hccb->last_error_codes = STM32_READ_BIT(p_ccb_instance->SR, CCB_SR_OPERR);
#endif /* USE_HAL_CCB_GET_LAST_ERRORS */
    hccb->global_state = HAL_CCB_STATE_FAULT;
    return HAL_ERROR;
  }

  CCB_RESET(hccb);

  hccb->global_state = HAL_CCB_STATE_IDLE;
  return HAL_OK;
}

/**
  * @brief  Wrap the clear symmetric key for ECC operations.
  * @param  hccb                    Pointer to a @ref hal_ccb_handle_t structure
  * @param  p_in_user_key           Pointer to the clear AES key
  * @param  p_wrapping_key_context  Pointer to the wrapping key context
  * @param  p_out_wrapped_user_key  Pointer to the wrapped user key
  * @retval HAL_INVALID_PARAM       The function return an Invalid param in the following cases: \n
                                    - The CCB handle is NULL \n
                                    - Input user key is NULL \n
                                    - Wrapping key context pointer key is NULL \n
                                    - Output wrapped user key pointer is NULL \n
  * @retval HAL_ERROR               Error detected
  * @retval HAL_OK                  Operation completed successfully
  */
hal_status_t HAL_CCB_ECC_WrapSymmetricKey(hal_ccb_handle_t *hccb, const uint32_t *p_in_user_key,
                                          hal_ccb_wrapping_sw_key_context_t *p_wrapping_key_context,
                                          uint32_t *p_out_wrapped_user_key)
{
  CCB_TypeDef *p_ccb_instance = NULL;

  ASSERT_DBG_PARAM(hccb != NULL);
  ASSERT_DBG_PARAM(p_in_user_key != NULL);
  ASSERT_DBG_PARAM(p_wrapping_key_context != NULL);
  ASSERT_DBG_PARAM(IS_CCB_AES_MODE(p_wrapping_key_context->aes_algorithm));
  ASSERT_DBG_PARAM(p_wrapping_key_context->p_init_vect != NULL);
  ASSERT_DBG_PARAM(p_wrapping_key_context->key_size != 0U);
  ASSERT_DBG_PARAM(p_out_wrapped_user_key != NULL);

  ASSERT_DBG_STATE(hccb->global_state, (uint32_t)HAL_CCB_STATE_IDLE);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hccb == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

