MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_ccb.c
  /* Random wait: introduce a random-duration loop to complicate timing/fault attacks.
     The loop count is derived from TRNG and then checked to detect potential fault injection. */
  for (uint16_t j = 0U; j < randoms[1]; ++j)
  {
    random_count++;
  }

  tmp_random_count = random_count;

  /* Check if it is valid signature and improve robustness against intrusion (intentional) */
  if ((pka_ram_u32[PKA_ECDSA_VERIF_OUT_RESULT] != CCB_PKA_RESULT_OK) || (tmp_random_count != randoms[1]))
  {
    CCB_ErasePoolBuffer(p_base_pool_buff, p_in_curve_param->ecdsa_pool_buffer.buff_size_byte);
    hccb->global_state = HAL_CCB_STATE_IDLE;
    return HAL_ERROR;
  }

  /* Initialize random_count and Check random number */
  random_count = 0U;
  if (randoms[2] == 0U)
  {
    CCB_ErasePoolBuffer(p_base_pool_buff, p_in_curve_param->ecdsa_pool_buffer.buff_size_byte);
    hccb->global_state = HAL_CCB_STATE_IDLE;
    return HAL_ERROR;
  }

  /* Random wait: introduce a random-duration loop to complicate timing/fault attacks.
     The loop count is derived from TRNG and then checked to detect potential fault injection. */
  for (uint16_t j = 0U; j < randoms[2]; ++j)
  {
    random_count++;
  }

  tmp_random_count = random_count;

  /* Check if it is valid signature and improve robustness against intrusion (intentional) */
  if ((pka_ram_u32[PKA_ECDSA_VERIF_OUT_RESULT] != CCB_PKA_RESULT_OK) || (tmp_random_count != randoms[2]))
  {
    CCB_ErasePoolBuffer(p_base_pool_buff, p_in_curve_param->ecdsa_pool_buffer.buff_size_byte);
    hccb->global_state = HAL_CCB_STATE_IDLE;
    return HAL_ERROR;
  }

  /* Export created Blob */
  for (uint32_t count = 0U; count < cipherkey_size; count++)
  {
    if (count < CCB_BLOCK_SIZE_WORD)
    {
      p_out_wrapped_private_key_blob->p_iv[count] = (p_tmp_iv[count] ^ random32);
      p_out_wrapped_private_key_blob->p_tag[count] = (p_tmp_tag[count] ^ random32);
    }
    p_out_wrapped_private_key_blob->p_wrapped_key[count] = (p_tmp_wrapped_key[count] ^ random32);
  }

  CCB_ErasePoolBuffer(p_base_pool_buff, p_in_curve_param->ecdsa_pool_buffer.buff_size_byte);

  hccb->global_state = HAL_CCB_STATE_IDLE;
  return HAL_OK;
}

/**
  * @brief  Blob Creation: ECDSA Wrapping an RNG generated Key with a wrapped symmetric software key.
  * @param  hccb                            Pointer to a @ref hal_ccb_handle_t structure
  * @param  p_in_curve_param                Pointer to a @ref hal_ccb_ecdsa_curve_param_t structure
  * @param  p_wrapping_key_context          Pointer to a @ref hal_ccb_wrapping_sw_key_context_t structure
  * @param  p_in_wrapped_user_key           Pointer to the wrapped user key
  * @param  p_out_wrapped_private_key_blob  Pointer to a @ref hal_ccb_ecdsa_key_blob_t structure
  * @retval HAL_INVALID_PARAM               The function return an Invalid param in the following cases: \n
                                            - The CCB handle is NULL \n
                                            - Input curve parameters pointer is NULL \n
                                            - Curve parameter abs_coef_a pointer is NULL \n
                                            - Curve parameter coef_b pointer is NULL \n
                                            - Curve parameter modulus pointer is NULL \n
                                            - Curve parameter prime_order pointer is NULL \n
                                            - Curve parameter point_x pointer is NULL \n
                                            - Curve parameter point_y pointer is NULL \n
                                            - Curve parameter prime_order_size_byte is zero \n
                                            - Curve parameter modulus_size_byte is zero \n
                                            - Curve parameter coef_sign_a is zero \n
                                            - Wrapping key context pointer key is NULL \n
                                            - Provided init vector pointer is NULL \n
                                            - Provided key size pointer is NULL \n
                                            - Input wrapped user key pointer is NULL \n
                                            - Output wrapped private key blob pointer is NULL \n
                                            - Output wrapped private key blob IV pointer is NULL \n
                                            - Output wrapped private key blob tag pointer is NULL \n
  * @retval HAL_ERROR                       Error detected
  * @retval HAL_OK                          Operation completed successfully
  */
hal_status_t HAL_CCB_ECDSA_SW_GenerateWrapPrivateKey(hal_ccb_handle_t *hccb,
                                                     const hal_ccb_ecdsa_curve_param_t *p_in_curve_param,
                                                     const hal_ccb_wrapping_sw_key_context_t *p_wrapping_key_context,
                                                     const uint32_t *p_in_wrapped_user_key,
                                                     hal_ccb_ecdsa_key_blob_t *p_out_wrapped_private_key_blob)
{

  uint32_t *p_tmp_iv = NULL;
  uint32_t *p_tmp_tag = NULL;
  uint32_t *p_tmp_wrapped_key = NULL;
  __IOM const uint32_t *pka_ram_u32 = NULL;
  uint32_t operand_size = 0U;
  uint32_t cipherkey_size = 0U;
  uint32_t offset_pool_buff = 0U;
  uint32_t random32 = 0U;
  volatile uint16_t random_count = 0U;
  uint16_t tmp_random_count = 0U;
  uint16_t randoms[3] = {0U};
  uint8_t *p_base_pool_buff = NULL;
  CCB_TypeDef *p_ccb_instance = NULL;
  hal_ccb_ecdsa_sign_t signature = {NULL, NULL};
  hal_ccb_ecc_point_t public_key_out = {NULL, NULL};
  ccb_sw_unwrap_key_context_t sw_ctx = {CCB_KEY_TYPE_SOFTWARE, p_wrapping_key_context, p_in_wrapped_user_key};

  ASSERT_DBG_PARAM(hccb != NULL);
  ASSERT_DBG_PARAM(p_in_curve_param != NULL);
  ASSERT_DBG_PARAM(p_in_curve_param->p_abs_coef_a != NULL);
  ASSERT_DBG_PARAM(p_in_curve_param->p_coef_b != NULL);
  ASSERT_DBG_PARAM(p_in_curve_param->p_modulus != NULL);
  ASSERT_DBG_PARAM(p_in_curve_param->p_prime_order != NULL);
  ASSERT_DBG_PARAM(p_in_curve_param->p_point_x != NULL);
  ASSERT_DBG_PARAM(p_in_curve_param->p_point_y != NULL);
  ASSERT_DBG_PARAM(p_in_curve_param->prime_order_size_byte != 0U);
  ASSERT_DBG_PARAM(p_in_curve_param->modulus_size_byte != 0U);
  ASSERT_DBG_PARAM(p_in_curve_param->coef_sign_a != 0U);
  ASSERT_DBG_PARAM(p_in_curve_param->ecdsa_pool_buffer.p_buff != NULL);
  ASSERT_DBG_PARAM(IS_CCB_ECDSA_POOL_BUFFER_SIZE(p_in_curve_param->ecdsa_pool_buffer.buff_size_byte,
                                                 p_in_curve_param->modulus_size_byte));
  ASSERT_DBG_PARAM(p_wrapping_key_context != NULL);
  ASSERT_DBG_PARAM(p_wrapping_key_context->p_init_vect != NULL);
  ASSERT_DBG_PARAM(p_wrapping_key_context->key_size != 0U);
  ASSERT_DBG_PARAM(IS_CCB_AES_MODE(p_wrapping_key_context->aes_algorithm));
  ASSERT_DBG_PARAM(p_in_wrapped_user_key != NULL);
  ASSERT_DBG_PARAM(p_out_wrapped_private_key_blob != NULL);
  ASSERT_DBG_PARAM(p_out_wrapped_private_key_blob->p_iv != NULL);
  ASSERT_DBG_PARAM(p_out_wrapped_private_key_blob->p_tag != NULL);
  ASSERT_DBG_PARAM(p_out_wrapped_private_key_blob->p_wrapped_key != NULL);

  ASSERT_DBG_STATE(hccb->global_state, (uint32_t)HAL_CCB_STATE_IDLE);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hccb == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

