MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_ccb.c
#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
   || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if ((p_in_curve_param == NULL) || (p_in_curve_param->p_abs_coef_a == NULL)
      || (p_in_curve_param->p_coef_b == NULL) || (p_in_curve_param->p_modulus == NULL)
      || (p_in_curve_param->p_prime_order == NULL) || (p_in_curve_param->p_point_x == NULL)
      || (p_in_curve_param->p_point_y == NULL) || (p_in_curve_param->prime_order_size_byte == 0U)
      || (p_in_curve_param->modulus_size_byte == 0U) || (p_in_curve_param->coef_sign_a == 0U)
      || (p_wrapping_key_context == NULL) || (p_wrapping_key_context->p_init_vect == NULL)
      || (p_wrapping_key_context->key_size == 0U) || (p_in_wrapped_private_key_blob == NULL)
      || (p_in_wrapped_private_key_blob->p_iv == NULL) || (p_in_wrapped_private_key_blob->p_tag == NULL)
      || (p_in_wrapped_private_key_blob->p_wrapped_key == NULL) || (p_in_hash == NULL) || (hash_size == 0U)
      || (p_out_signature == NULL) || (p_out_signature->p_r_sign == NULL) || (p_out_signature->p_s_sign == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hccb, global_state, HAL_CCB_STATE_IDLE, HAL_CCB_STATE_ACTIVE);

  CCB_RESET(hccb);

#if defined(USE_HAL_CCB_GET_LAST_ERRORS) && (USE_HAL_CCB_GET_LAST_ERRORS == 1)
  hccb->last_error_codes = HAL_CCB_ERROR_NONE;
#endif /* USE_HAL_CCB_GET_LAST_ERRORS */

  p_ccb_instance = CCB_GET_INSTANCE(hccb);

  if (CCB_RNG_Init(RNG) != HAL_OK)
  {
    hccb->global_state = HAL_CCB_STATE_IDLE;
    return HAL_ERROR;
  }

  if (CCB_ECDSA_Sign(p_ccb_instance, p_in_curve_param, &sw_ctx, p_in_wrapped_private_key_blob, p_in_hash, hash_size,
                     p_out_signature) != HAL_OK)
  {
#if defined(USE_HAL_CCB_GET_LAST_ERRORS) && (USE_HAL_CCB_GET_LAST_ERRORS == 1)
    hccb->last_error_codes = STM32_READ_BIT(p_ccb_instance->SR, CCB_SR_OPERR);
#endif /* USE_HAL_CCB_GET_LAST_ERRORS */
    hccb->global_state = HAL_CCB_STATE_FAULT;
    return HAL_ERROR;
  }

  CCB_RESET(hccb);

  hccb->global_state = HAL_CCB_STATE_IDLE;
  return HAL_OK;
}

/**
  * @brief  Blob Usage: ECDSA Compute Public Key with a wrapped symmetric software key.
  * @param  hccb                           Pointer to a @ref hal_ccb_handle_t structure
  * @param  p_in_curve_param               Pointer to a @ref hal_ccb_ecdsa_curve_param_t structure
  * @param  p_wrapping_key_context         Pointer to a @ref hal_ccb_wrapping_sw_key_context_t structure
  * @param  p_in_wrapped_user_key          Pointer to the wrapped user key
  * @param  p_in_wrapped_private_key_blob  Pointer to a @ref hal_ccb_ecdsa_key_blob_t structure
  * @param  p_out_public_key               Pointer to a @ref hal_ccb_ecc_point_t structure
  * @retval HAL_INVALID_PARAM              The function return an Invalid param in the following cases: \n
                                           - The CCB handle is NULL \n
                                           - Input curve parameters pointer is NULL \n
                                           - Curve parameter abs_coef_a pointer is NULL \n
                                           - Curve parameter coef_b pointer is NULL \n
                                           - Curve parameter modulus pointer is NULL \n
                                           - Curve parameter prime_order pointer is NULL \n
                                           - Curve parameter point_x pointer is NULL \n
                                           - Curve parameter point_y pointer is NULL \n
                                           - Curve parameter prime_order_size_byte is zero \n
                                           - Curve parameter modulus_size_byte is zero \n
                                           - Curve parameter coef_sign_a is zero \n
                                           - Wrapping key context pointer key is NULL \n
                                           - Provided init vector pointer is NULL \n
                                           - Provided key size pointer is NULL \n
                                           - Input wrapped user key pointer is NULL \n
                                           - Input wrapped private key blob pointer is NULL \n
                                           - Input wrapped private key blob IV pointer is NULL \n
                                           - Input wrapped private key blob tag pointer is NULL \n
                                           - Input wrapped private key blob wrapped key pointer is NULL \n
                                           - Input hash pointer is NULL \n
                                           - Output public key point_x pointer is NULL \n
                                           - Output public key point_y pointer is NULL \n
                                           - Output public key pointer is NULL \n
  * @retval HAL_ERROR                      Error detected
  * @retval HAL_OK                         Operation completed successfully
  */
hal_status_t HAL_CCB_ECDSA_SW_ComputePublicKey(hal_ccb_handle_t *hccb,
                                               const hal_ccb_ecdsa_curve_param_t *p_in_curve_param,
                                               const hal_ccb_wrapping_sw_key_context_t *p_wrapping_key_context,
                                               const uint32_t *p_in_wrapped_user_key,
                                               hal_ccb_ecdsa_key_blob_t *p_in_wrapped_private_key_blob,
                                               hal_ccb_ecc_point_t *p_out_public_key)

{
  CCB_TypeDef *p_ccb_instance = NULL;
  ccb_sw_unwrap_key_context_t sw_ctx = {CCB_KEY_TYPE_SOFTWARE, p_wrapping_key_context, p_in_wrapped_user_key};

  ASSERT_DBG_PARAM(hccb != NULL);
  ASSERT_DBG_PARAM(p_in_curve_param != NULL);
  ASSERT_DBG_PARAM(p_in_curve_param->p_abs_coef_a != NULL);
  ASSERT_DBG_PARAM(p_in_curve_param->p_coef_b != NULL);
  ASSERT_DBG_PARAM(p_in_curve_param->p_modulus != NULL);
  ASSERT_DBG_PARAM(p_in_curve_param->p_prime_order != NULL);
  ASSERT_DBG_PARAM(p_in_curve_param->p_point_x != NULL);
  ASSERT_DBG_PARAM(p_in_curve_param->p_point_y != NULL);
  ASSERT_DBG_PARAM(p_in_curve_param->prime_order_size_byte != 0U);
  ASSERT_DBG_PARAM(p_in_curve_param->modulus_size_byte != 0U);
  ASSERT_DBG_PARAM(p_in_curve_param->coef_sign_a != 0U);
  ASSERT_DBG_PARAM(p_wrapping_key_context != NULL);
  ASSERT_DBG_PARAM(p_wrapping_key_context->p_init_vect != NULL);
  ASSERT_DBG_PARAM(p_wrapping_key_context->key_size != 0U);
  ASSERT_DBG_PARAM(IS_CCB_AES_MODE(p_wrapping_key_context->aes_algorithm));
  ASSERT_DBG_PARAM(p_in_wrapped_user_key != NULL);
  ASSERT_DBG_PARAM(p_in_wrapped_private_key_blob != NULL);
  ASSERT_DBG_PARAM(p_in_wrapped_private_key_blob->p_iv != NULL);
  ASSERT_DBG_PARAM(p_in_wrapped_private_key_blob->p_tag != NULL);
  ASSERT_DBG_PARAM(p_in_wrapped_private_key_blob->p_wrapped_key != NULL);
  ASSERT_DBG_PARAM(p_out_public_key != NULL);
  ASSERT_DBG_PARAM(p_out_public_key->p_point_x != NULL);
  ASSERT_DBG_PARAM(p_out_public_key->p_point_y != NULL);

  ASSERT_DBG_STATE(hccb->global_state, (uint32_t)HAL_CCB_STATE_IDLE);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hccb == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

