MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_ccb.c
#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
   || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if ((p_in_curve_param == NULL) || (p_in_curve_param->p_abs_coef_a == NULL)
      || (p_in_curve_param->p_coef_b == NULL) || (p_in_curve_param->p_modulus == NULL)
      || (p_in_curve_param->p_prime_order == NULL) || (p_in_curve_param->p_point_x == NULL)
      || (p_in_curve_param->p_point_y == NULL) || (p_in_curve_param->prime_order_size_byte == 0U)
      || (p_in_curve_param->modulus_size_byte == 0U) || (p_in_curve_param->coef_sign_a == 0U)
      || (p_in_curve_param->ecc_pool_buffer.p_buff == NULL)
      || ((p_in_curve_param->ecc_pool_buffer.buff_size_byte)
          < (HAL_CCB_ECC_CALC_BUFFER_SIZE(p_in_curve_param->modulus_size_byte)))
      || (p_wrapping_key_context == NULL) || (p_wrapping_key_context->p_init_vect == NULL)
      || (p_wrapping_key_context->key_size == 0U) || (p_in_wrapped_user_key == NULL)
      || (p_out_wrapped_private_key_blob == NULL) || (p_out_wrapped_private_key_blob->p_iv == NULL)
      || (p_out_wrapped_private_key_blob->p_tag == NULL) || (p_out_wrapped_private_key_blob->p_wrapped_key == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hccb, global_state, HAL_CCB_STATE_IDLE, HAL_CCB_STATE_ACTIVE);

  CCB_RESET(hccb);

#if defined(USE_HAL_CCB_GET_LAST_ERRORS) && (USE_HAL_CCB_GET_LAST_ERRORS == 1)
  hccb->last_error_codes = HAL_CCB_ERROR_NONE;
#endif /* USE_HAL_CCB_GET_LAST_ERRORS */

  p_ccb_instance = CCB_GET_INSTANCE(hccb);

  if (CCB_RNG_Init(RNG) != HAL_OK)
  {
    hccb->global_state = HAL_CCB_STATE_IDLE;
    return HAL_ERROR;
  }

  if (CCB_RNG_GenerateRandomNumbers(RNG, randoms) != HAL_OK)
  {
    hccb->global_state = HAL_CCB_STATE_IDLE;
    return HAL_ERROR;
  }

  p_base_pool_buff = (uint8_t *)p_in_curve_param->ecc_pool_buffer.p_buff;

  CCB_ErasePoolBuffer(p_base_pool_buff, p_in_curve_param->ecc_pool_buffer.buff_size_byte);

  operand_size = 2UL * (((p_in_curve_param->modulus_size_byte + 7UL) >> 3UL) + 1UL);
  cipherkey_size = ((operand_size & 3U) != 0U) ? (operand_size - 2U) : operand_size;
  p_scalar_mul_y = (uint32_t *)(void *)&p_base_pool_buff[offset_pool_buff];
  offset_pool_buff += ((p_in_curve_param->modulus_size_byte + 3U) >> 2U) * CCB_BLOCK_SIZE_WORD;
  p_tmp_iv = (uint32_t *)(void *)&p_base_pool_buff[offset_pool_buff];
  offset_pool_buff += 4U * sizeof(uint32_t);
  p_tmp_tag = (uint32_t *)(void *)&p_base_pool_buff[offset_pool_buff];
  offset_pool_buff += 4U * sizeof(uint32_t);
  p_tmp_wrapped_key = (uint32_t *)(void *)&p_base_pool_buff[offset_pool_buff];
  random32 = (((uint32_t)randoms[1] << 16U) | (uint32_t)randoms[0]);

  if (CCB_ECC_ScalarMulBlobCreation(p_ccb_instance, p_in_curve_param, &sw_ctx, NULL, p_tmp_iv, p_tmp_tag,
                                    p_tmp_wrapped_key, random32,
                                    p_out_wrapped_private_key_blob->p_wrapped_key, p_scalar_mul_y,
                                    CCB_ECC_SCALAR_MUL_RNG_BLOB_CREATION) != HAL_OK)
  {
    CCB_ErasePoolBuffer(p_base_pool_buff, p_in_curve_param->ecc_pool_buffer.buff_size_byte);
#if defined(USE_HAL_CCB_GET_LAST_ERRORS) && (USE_HAL_CCB_GET_LAST_ERRORS == 1)
    hccb->last_error_codes = STM32_READ_BIT(p_ccb_instance->SR, CCB_SR_OPERR);
#endif /* USE_HAL_CCB_GET_LAST_ERRORS */
    hccb->global_state = HAL_CCB_STATE_FAULT;
    return HAL_ERROR;
  }

  CCB_RESET(hccb);

  if (CCB_ECC_ComputeScalarMul(p_ccb_instance, p_in_curve_param, &sw_ctx, p_tmp_iv, p_tmp_tag, p_tmp_wrapped_key,
                               random32, NULL, NULL) != HAL_OK)
  {
    CCB_ErasePoolBuffer(p_base_pool_buff, p_in_curve_param->ecc_pool_buffer.buff_size_byte);
#if defined(USE_HAL_CCB_GET_LAST_ERRORS) && (USE_HAL_CCB_GET_LAST_ERRORS == 1)
    hccb->last_error_codes = STM32_READ_BIT(p_ccb_instance->SR, CCB_SR_OPERR);
#endif /* USE_HAL_CCB_GET_LAST_ERRORS */
    hccb->global_state = HAL_CCB_STATE_FAULT;
    return HAL_ERROR;
  }

  modulus_words_count = (p_in_curve_param->modulus_size_byte + 3UL) >> 2UL;
  if (randoms[0] == 0U)
  {
    CCB_ErasePoolBuffer(p_base_pool_buff, p_in_curve_param->ecc_pool_buffer.buff_size_byte);
    hccb->global_state = HAL_CCB_STATE_IDLE;
    return HAL_ERROR;
  }

  /* Random wait: introduce a random-duration loop to complicate timing/fault attacks.
     The loop count is derived from TRNG and then checked to detect potential fault injection. */
  for (uint16_t j = 0U; j < randoms[0]; ++j)
  {
    random_count++;
  }

  pka_ram_u32 = (__IOM uint32_t *)PKA->RAM;
  tmp_random_count = random_count;

  /* Check Scalar Multiplication and improve robustness against intrusion (intentional) */
  /* P coordinate x */
  for (uint32_t word_offset = 0UL; word_offset < modulus_words_count; word_offset++)
  {
    diff |= pka_ram_u32[PKA_ECC_SCALAR_MUL_OUT_RESULT_X + word_offset]
            ^ p_out_wrapped_private_key_blob->p_wrapped_key[word_offset];
  }

  if ((diff != 0U) || (tmp_random_count != randoms[0]))
  {
    CCB_ErasePoolBuffer(p_base_pool_buff, p_in_curve_param->ecc_pool_buffer.buff_size_byte);
    hccb->global_state = HAL_CCB_STATE_IDLE;
    return HAL_ERROR;
  }

  /* P coordinate y */
  for (uint32_t word_offset = 0UL; word_offset < modulus_words_count; word_offset++)
  {
    diff |= pka_ram_u32[PKA_ECC_SCALAR_MUL_OUT_RESULT_Y + word_offset] ^ p_scalar_mul_y[word_offset];
  }

  if ((diff != 0U) || (tmp_random_count != randoms[0]))
  {
    CCB_ErasePoolBuffer(p_base_pool_buff, p_in_curve_param->ecc_pool_buffer.buff_size_byte);
    hccb->global_state = HAL_CCB_STATE_IDLE;
    return HAL_ERROR;
  }

  /* Initialize random_count and Check random number */
  random_count = 0U;
  if (randoms[1] == 0U)
  {
    CCB_ErasePoolBuffer(p_base_pool_buff, p_in_curve_param->ecc_pool_buffer.buff_size_byte);
    hccb->global_state = HAL_CCB_STATE_IDLE;
    return HAL_ERROR;
  }

  /* Random wait: introduce a random-duration loop to complicate timing/fault attacks.
     The loop count is derived from TRNG and then checked to detect potential fault injection. */
  for (uint16_t j = 0U; j < randoms[1]; ++j)
  {
    random_count++;
  }

