MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_ccb.c
  if ((diff != 0U) || (tmp_random_count != randoms[1]))
  {
    CCB_ErasePoolBuffer(p_base_pool_buff, p_in_param->rsa_pool_buffer.buff_size_byte);
    hccb->global_state = HAL_CCB_STATE_IDLE;
    return HAL_ERROR;
  }

  /* Initialize random_count and Check random number */
  random_count = 0U;
  if (randoms[2] == 0U)
  {
    CCB_ErasePoolBuffer(p_base_pool_buff, p_in_param->rsa_pool_buffer.buff_size_byte);
    hccb->global_state = HAL_CCB_STATE_IDLE;
    return HAL_ERROR;
  }

  /* Random wait: introduce a random-duration loop to complicate timing/fault attacks.
     The loop count is derived from TRNG and then checked to detect potential fault injection. */
  for (uint16_t j = 0U; j < randoms[2]; ++j)
  {
    random_count++;
  }

  tmp_random_count = random_count;

  /* Check Modular Exponentiation and improve robustness against intrusion (intentional) */
  for (uint32_t word_offset = 0UL; word_offset < modulus_words_count; word_offset++)
  {
    diff |= pka_ram_u32[PKA_MODULAR_EXP_OUT_RESULT + word_offset] ^
            p_out_wrapped_private_key_blob->p_wrapped_phi[word_offset];
  }

  if ((diff != 0U) || (tmp_random_count != randoms[2]))
  {
    CCB_ErasePoolBuffer(p_base_pool_buff, p_in_param->rsa_pool_buffer.buff_size_byte);
    hccb->global_state = HAL_CCB_STATE_IDLE;
    return HAL_ERROR;
  }

  CCB_RESET(hccb);

  /* Export created Blob */
  for (uint32_t count = 0U; count < cipherkey_size; count++)
  {
    if (count < CCB_BLOCK_SIZE_WORD)
    {
      p_out_wrapped_private_key_blob->p_iv[count] = (p_tmp_iv[count] ^ random32);
      p_out_wrapped_private_key_blob->p_tag[count] = (p_tmp_tag[count] ^ random32);
    }
    p_out_wrapped_private_key_blob->p_wrapped_exp[count] = (p_tmp_wrapped_exp[count] ^ random32);
    p_out_wrapped_private_key_blob->p_wrapped_phi[count] = (p_tmp_wrapped_phi[count] ^ random32);
  }

  CCB_ErasePoolBuffer(p_base_pool_buff, p_in_param->rsa_pool_buffer.buff_size_byte);

  hccb->global_state = HAL_CCB_STATE_IDLE;
  return HAL_OK;
}

/**
  * @brief  Blob Usage: RSA Compute Modular exponentiation with a wrapped symmetric software key.
  * @param  hccb                           Pointer to a @ref hal_ccb_handle_t structure
  * @param  p_in_param                     Pointer to a @ref hal_ccb_rsa_param_t structure
  * @param  p_wrapping_key_context         Pointer to a @ref hal_ccb_wrapping_sw_key_context_t structure
  * @param  p_in_wrapped_user_key          Pointer to the wrapped user key
  * @param  p_in_wrapped_private_key_blob  Pointer to @ref hal_ccb_rsa_key_blob_t structure
  * @param  p_in_operand                   Pointer to the operand
  * @param  p_out_modular_exp              Pointer to the output operation
  * @retval HAL_INVALID_PARAM              The function return an Invalid param in the following cases: \n
                                           - The CCB handle is NULL \n
                                           - Input parameters pointer is NULL \n
                                           - Input parameter exp_size_byte is zero \n
                                           - Input parameter modulus_size_byte is zero \n
                                           - Input parameter modulus pointer is NULL \n
                                           - Wrapping key context pointer key is NULL \n
                                           - Provided init vector pointer is NULL \n
                                           - Provided key size pointer is NULL \n
                                           - Input wrapped private key blob pointer is NULL \n
                                           - Input wrapped private key blob IV pointer is NULL \n
                                           - Input wrapped private key blob tag pointer is NULL \n
                                           - Input wrapped private key blob wrapped exp pointer is NULL \n
                                           - Input wrapped private key blob wrapped phi pointer is NULL \n
                                           - Output operand pointer is NULL \n
                                           - Output modular exp pointer is NULL \n
  * @retval HAL_ERROR                      Error detected
  * @retval HAL_OK                         Operation completed successfully
  */
hal_status_t HAL_CCB_RSA_SW_ComputeModularExp(hal_ccb_handle_t *hccb, const hal_ccb_rsa_param_t *p_in_param,
                                              const hal_ccb_wrapping_sw_key_context_t *p_wrapping_key_context,
                                              const uint32_t *p_in_wrapped_user_key,
                                              hal_ccb_rsa_key_blob_t *p_in_wrapped_private_key_blob,
                                              const uint8_t *p_in_operand, uint8_t *p_out_modular_exp)
{
  CCB_TypeDef *p_ccb_instance = NULL;
  ccb_sw_unwrap_key_context_t sw_ctx = {CCB_KEY_TYPE_SOFTWARE, p_wrapping_key_context, p_in_wrapped_user_key};

  ASSERT_DBG_PARAM(hccb != NULL);
  ASSERT_DBG_PARAM(p_in_param != NULL);
  ASSERT_DBG_PARAM(p_in_param->exp_size_byte != 0U);
  ASSERT_DBG_PARAM(p_in_param->modulus_size_byte != 0U);
  ASSERT_DBG_PARAM(p_in_param->p_mod != NULL);
  ASSERT_DBG_PARAM(p_wrapping_key_context != NULL);
  ASSERT_DBG_PARAM(p_wrapping_key_context->p_init_vect != NULL);
  ASSERT_DBG_PARAM(p_wrapping_key_context->key_size != 0U);
  ASSERT_DBG_PARAM(p_in_wrapped_user_key != NULL);
  ASSERT_DBG_PARAM(IS_CCB_AES_MODE(p_wrapping_key_context->aes_algorithm));
  ASSERT_DBG_PARAM(p_in_wrapped_private_key_blob != NULL);
  ASSERT_DBG_PARAM(p_in_wrapped_private_key_blob->p_iv != NULL);
  ASSERT_DBG_PARAM(p_in_wrapped_private_key_blob->p_tag != NULL);
  ASSERT_DBG_PARAM(p_in_wrapped_private_key_blob->p_wrapped_exp != NULL);
  ASSERT_DBG_PARAM(p_in_wrapped_private_key_blob->p_wrapped_phi != NULL);
  ASSERT_DBG_PARAM(p_in_operand != NULL);
  ASSERT_DBG_PARAM(p_out_modular_exp != NULL);

  ASSERT_DBG_STATE(hccb->global_state, (uint32_t)HAL_CCB_STATE_IDLE);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hccb == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

