MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_ccb.c
  /* Random wait: introduce a random-duration loop to complicate timing/fault attacks.
     The loop count is derived from TRNG and then checked to detect potential fault injection. */
  for (uint16_t j = 0U; j < randoms[1]; ++j)
  {
    random_count++;
  }

  tmp_random_count = random_count;

  /* Check if it is valid signature and improve robustness against intrusion (intentional) */
  if ((pka_ram_u32[PKA_ECDSA_VERIF_OUT_RESULT] != CCB_PKA_RESULT_OK) || (tmp_random_count != randoms[1]))
  {
    CCB_ErasePoolBuffer(p_base_pool_buff, p_in_curve_param->ecdsa_pool_buffer.buff_size_byte);
    hccb->global_state = HAL_CCB_STATE_IDLE;
    return HAL_ERROR;
  }

  /* Initialize random_count and Check random number */
  random_count = 0U;
  if (randoms[2] == 0U)
  {
    CCB_ErasePoolBuffer(p_base_pool_buff, p_in_curve_param->ecdsa_pool_buffer.buff_size_byte);
    hccb->global_state = HAL_CCB_STATE_IDLE;
    return HAL_ERROR;
  }

  /* Random wait: introduce a random-duration loop to complicate timing/fault attacks.
     The loop count is derived from TRNG and then checked to detect potential fault injection. */
  for (uint16_t j = 0U; j < randoms[2]; ++j)
  {
    random_count++;
  }

  tmp_random_count = random_count;

  /* Check if it is valid signature and improve robustness against intrusion (intentional) */
  if ((pka_ram_u32[PKA_ECDSA_VERIF_OUT_RESULT] != CCB_PKA_RESULT_OK) || (tmp_random_count != randoms[2]))
  {
    CCB_ErasePoolBuffer(p_base_pool_buff, p_in_curve_param->ecdsa_pool_buffer.buff_size_byte);
    hccb->global_state = HAL_CCB_STATE_IDLE;
    return HAL_ERROR;
  }

  /* Export created Blob */
  for (uint32_t count = 0U; count < cipherkey_size; count++)
  {
    if (count < CCB_BLOCK_SIZE_WORD)
    {
      p_out_wrapped_private_key_blob->p_iv[count] = (p_tmp_iv[count] ^ random32);
      p_out_wrapped_private_key_blob->p_tag[count] = (p_tmp_tag[count] ^ random32);
    }
    p_out_wrapped_private_key_blob->p_wrapped_key[count] = (p_tmp_wrapped_key[count] ^ random32);
  }

  CCB_ErasePoolBuffer(p_base_pool_buff, p_in_curve_param->ecdsa_pool_buffer.buff_size_byte);

  hccb->global_state = HAL_CCB_STATE_IDLE;
  return HAL_OK;
}

/**
  * @brief  Blob Usage: ECDSA Signature with a hardware key.
  * @param  hccb                           Pointer to a @ref hal_ccb_handle_t structure
  * @param  p_in_curve_param               Pointer to a @ref hal_ccb_ecdsa_curve_param_t structure
  * @param  wrapping_hw_key_type           Wrapping key with a **hal_ccb_wrapping_hw_key_type_t** type
  * @param  p_in_wrapped_private_key_blob  Pointer to a @ref hal_ccb_ecdsa_key_blob_t structure
  * @param  p_in_hash                      Pointer to the hash message
  * @param  hash_size                      Specify the size of the hash message
  * @param  p_out_signature                Pointer to a @ref hal_ccb_ecdsa_sign_t structure
  * @retval HAL_INVALID_PARAM              The function return an Invalid param in the following cases: \n
                                           - The CCB handle is NULL \n
                                           - Input curve parameters pointer is NULL \n
                                           - Curve parameter abs_coef_a pointer is NULL \n
                                           - Curve parameter coef_b pointer is NULL \n
                                           - Curve parameter modulus pointer is NULL \n
                                           - Curve parameter prime_order pointer is NULL \n
                                           - Curve parameter point_x pointer is NULL \n
                                           - Curve parameter point_y pointer is NULL \n
                                           - Curve parameter prime_order_size_byte is zero \n
                                           - Curve parameter modulus_size_byte is zero \n
                                           - Curve parameter coef_sign_a is zero \n
                                           - Input wrapped private key blob pointer is NULL \n
                                           - Input wrapped private key blob IV pointer is NULL \n
                                           - Input wrapped private key blob tag pointer is NULL \n
                                           - Input hash pointer is NULL \n
                                           - Hash size is zero \n
                                           - Output signature pointer is NULL \n
                                           - Output signature r_sign pointer is NULL \n
                                           - Output signature s_sign pointer is NULL \n
  * @retval HAL_ERROR                      Error detected
  * @retval HAL_OK                         Operation completed successfully
  */
hal_status_t HAL_CCB_ECDSA_HW_Sign(hal_ccb_handle_t *hccb, const hal_ccb_ecdsa_curve_param_t *p_in_curve_param,
                                   hal_ccb_wrapping_hw_key_type_t wrapping_hw_key_type,
                                   hal_ccb_ecdsa_key_blob_t *p_in_wrapped_private_key_blob, const uint8_t *p_in_hash,
                                   uint8_t hash_size, hal_ccb_ecdsa_sign_t *p_out_signature)
{
  CCB_TypeDef *p_ccb_instance = NULL;
  ccb_hw_unwrap_key_context_t hw_ctx = {CCB_KEY_TYPE_HARDWARE, wrapping_hw_key_type};

  ASSERT_DBG_PARAM(hccb != NULL);
  ASSERT_DBG_PARAM(p_in_curve_param != NULL);
  ASSERT_DBG_PARAM(p_in_curve_param->p_abs_coef_a != NULL);
  ASSERT_DBG_PARAM(p_in_curve_param->p_coef_b != NULL);
  ASSERT_DBG_PARAM(p_in_curve_param->p_modulus != NULL);
  ASSERT_DBG_PARAM(p_in_curve_param->p_prime_order != NULL);
  ASSERT_DBG_PARAM(p_in_curve_param->p_point_x != NULL);
  ASSERT_DBG_PARAM(p_in_curve_param->p_point_y != NULL);
  ASSERT_DBG_PARAM(p_in_curve_param->prime_order_size_byte != 0U);
  ASSERT_DBG_PARAM(p_in_curve_param->modulus_size_byte != 0U);
  ASSERT_DBG_PARAM(p_in_curve_param->coef_sign_a != 0U);
  ASSERT_DBG_PARAM(IS_CCB_HW_KEY_TYPE(wrapping_hw_key_type));
  ASSERT_DBG_PARAM(p_in_wrapped_private_key_blob != NULL);
  ASSERT_DBG_PARAM(p_in_wrapped_private_key_blob->p_iv != NULL);
  ASSERT_DBG_PARAM(p_in_wrapped_private_key_blob->p_tag != NULL);
  ASSERT_DBG_PARAM(p_in_wrapped_private_key_blob->p_wrapped_key != NULL);
  ASSERT_DBG_PARAM(p_in_hash != NULL);
  ASSERT_DBG_PARAM(hash_size != 0U);
  ASSERT_DBG_PARAM(p_out_signature != NULL);
  ASSERT_DBG_PARAM(p_out_signature->p_r_sign != NULL);
  ASSERT_DBG_PARAM(p_out_signature->p_s_sign != NULL);


  ASSERT_DBG_STATE(hccb->global_state, (uint32_t)HAL_CCB_STATE_IDLE);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hccb == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

