MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_ccb.c
#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
   || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if ((p_in_curve_param == NULL) || (p_in_curve_param->p_abs_coef_a == NULL)
      || (p_in_curve_param->p_coef_b == NULL) || (p_in_curve_param->p_modulus == NULL)
      || (p_in_curve_param->p_prime_order == NULL) || (p_in_curve_param->p_point_x == NULL)
      || (p_in_curve_param->p_point_y == NULL) || (p_in_curve_param->prime_order_size_byte == 0U)
      || (p_in_curve_param->modulus_size_byte == 0U) || (p_in_curve_param->coef_sign_a == 0U)
      || (p_in_wrapped_private_key_blob == NULL)
      || (p_in_wrapped_private_key_blob->p_iv == NULL) || (p_in_wrapped_private_key_blob->p_tag == NULL)
      || (p_in_wrapped_private_key_blob->p_wrapped_key == NULL) || (p_in_point == NULL)
      || (p_in_point->p_point_x == NULL) || (p_in_point->p_point_y == NULL) || (p_out_point == NULL)
      || (p_out_point->p_point_x == NULL) || (p_out_point->p_point_y == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hccb, global_state, HAL_CCB_STATE_IDLE, HAL_CCB_STATE_ACTIVE);

  CCB_RESET(hccb);

#if defined(USE_HAL_CCB_GET_LAST_ERRORS) && (USE_HAL_CCB_GET_LAST_ERRORS == 1)
  hccb->last_error_codes = HAL_CCB_ERROR_NONE;
#endif /* USE_HAL_CCB_GET_LAST_ERRORS */

  p_ccb_instance = CCB_GET_INSTANCE(hccb);

  if (CCB_ECC_ComputeScalarMul(p_ccb_instance, p_in_curve_param, &hw_ctx, p_in_wrapped_private_key_blob->p_iv,
                               p_in_wrapped_private_key_blob->p_tag, p_in_wrapped_private_key_blob->p_wrapped_key, 0U,
                               p_in_point, p_out_point) != HAL_OK)
  {
#if defined(USE_HAL_CCB_GET_LAST_ERRORS) && (USE_HAL_CCB_GET_LAST_ERRORS == 1)
    hccb->last_error_codes = STM32_READ_BIT(p_ccb_instance->SR, CCB_SR_OPERR);
#endif /* USE_HAL_CCB_GET_LAST_ERRORS */
    hccb->global_state = HAL_CCB_STATE_FAULT;
    return HAL_ERROR;
  }

  CCB_RESET(hccb);

  hccb->global_state = HAL_CCB_STATE_IDLE;
  return HAL_OK;
}

/**
  * @brief  Blob Creation: RSA Wrapping private Key with a hardware key.
  * @param  hccb                            Pointer to a @ref hal_ccb_handle_t structure
  * @param  p_in_param                      Pointer to @ref hal_ccb_rsa_param_t structure
  * @param  p_in_rsa_clear_private_key      Pointer to @ref hal_ccb_rsa_clear_key_t structure
  * @param  wrapping_hw_key_type            Wrapping key with a **hal_ccb_wrapping_hw_key_type_t** type
  * @param  p_out_wrapped_private_key_blob  Pointer to @ref hal_ccb_rsa_key_blob_t structure
  * @retval HAL_INVALID_PARAM               The function return an Invalid param in the following cases: \n
                                            - The CCB handle is NULL \n
                                            - Input parameters pointer is NULL \n
                                            - Input parameter exp_size_byte is zero \n
                                            - Input parameter modulus_size_byte is zero \n
                                            - Input parameter modulus pointer is NULL \n
                                            - Input RSA clear private key exp pointer is NULL \n
                                            - Input RSA clear private key phi pointer is NULL \n
                                            - Output wrapped private key blob pointer is NULL \n
                                            - Output wrapped private key blob IV pointer is NULL \n
                                            - Output wrapped private key blob tag pointer is NULL \n
                                            - Output wrapped private key blob wrapped exp pointer is NULL \n
                                            - Output wrapped private key blob wrapped phi pointer is NULL \n
  * @retval HAL_ERROR                       Error detected
  * @retval HAL_OK                          Operation completed successfully
  */
hal_status_t HAL_CCB_RSA_HW_WrapPrivateKey(hal_ccb_handle_t *hccb, const hal_ccb_rsa_param_t *p_in_param,
                                           const hal_ccb_rsa_clear_key_t *p_in_rsa_clear_private_key,
                                           hal_ccb_wrapping_hw_key_type_t wrapping_hw_key_type,
                                           hal_ccb_rsa_key_blob_t *p_out_wrapped_private_key_blob)
{
  uint32_t *p_tmp_iv = NULL;
  uint32_t *p_tmp_tag = NULL;
  uint32_t *p_tmp_wrapped_exp = NULL;
  uint32_t *p_tmp_wrapped_phi = NULL;
  __IOM const uint32_t *pka_ram_u32 = NULL;
  uint32_t modulus_words_count = 0U;
  uint32_t operand_size = 0U;
  uint32_t cipherkey_size = 0U;
  uint32_t offset_pool_buff = 0U;
  uint32_t random32 = 0U;
  uint16_t randoms[3] = {0U};
  uint32_t diff = 0U;
  volatile uint16_t random_count = 0U;
  uint16_t tmp_random_count = 0U;
  uint8_t *p_base_pool_buff = NULL;
  CCB_TypeDef *p_ccb_instance = NULL;
  ccb_hw_unwrap_key_context_t hw_ctx = {CCB_KEY_TYPE_HARDWARE, wrapping_hw_key_type};

  ASSERT_DBG_PARAM(hccb != NULL);
  ASSERT_DBG_PARAM(p_in_param != NULL);
  ASSERT_DBG_PARAM(p_in_param->exp_size_byte != 0U);
  ASSERT_DBG_PARAM(p_in_param->modulus_size_byte != 0U);
  ASSERT_DBG_PARAM(p_in_param->p_mod != NULL);
  ASSERT_DBG_PARAM(p_in_param->rsa_pool_buffer.p_buff != NULL);
  ASSERT_DBG_PARAM(IS_CCB_ECC_POOL_BUFFER_SIZE(p_in_param->rsa_pool_buffer.buff_size_byte,
                                               p_in_param->modulus_size_byte));
  ASSERT_DBG_PARAM(p_in_rsa_clear_private_key != NULL);
  ASSERT_DBG_PARAM(p_in_rsa_clear_private_key->p_exp != NULL);
  ASSERT_DBG_PARAM(p_in_rsa_clear_private_key->p_phi != NULL);
  ASSERT_DBG_PARAM(IS_CCB_HW_KEY_TYPE(wrapping_hw_key_type));
  ASSERT_DBG_PARAM(p_out_wrapped_private_key_blob != NULL);
  ASSERT_DBG_PARAM(p_out_wrapped_private_key_blob->p_iv != NULL);
  ASSERT_DBG_PARAM(p_out_wrapped_private_key_blob->p_tag != NULL);
  ASSERT_DBG_PARAM(p_out_wrapped_private_key_blob->p_wrapped_exp != NULL);
  ASSERT_DBG_PARAM(p_out_wrapped_private_key_blob->p_wrapped_phi != NULL);

  ASSERT_DBG_STATE(hccb->global_state, (uint32_t)HAL_CCB_STATE_IDLE);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hccb == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

