MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_ccb.c
  hccb->global_state = HAL_CCB_STATE_IDLE;
  return HAL_OK;
}
/**
  * @}
  */

/** @addtogroup CCB_Exported_Functions_Group6
  * @{
  */
/**
This subsection provides a set of functions to retrieve the state and the error codes
- HAL_CCB_GetState() retrieve the global CCB state.
- HAL_CCB_GetLastErrorCodes() retrieve the last CCB error code.
- HAL_CCB_SetUserData() store user data pointer into the handle.
- HAL_CCB_GetUserData() retrieve user data pointer from the handle.
  */

/**
  * @brief  Return the CCB state.
  * @param  hccb pointer to @ref hal_ccb_handle_t structure.
  * @retval hal_ccb_state_t CCB global state.
  */
hal_ccb_state_t HAL_CCB_GetState(const hal_ccb_handle_t *hccb)
{
  ASSERT_DBG_PARAM(hccb != NULL);

  return (hccb->global_state);
}

#if defined(USE_HAL_CCB_GET_LAST_ERRORS) && (USE_HAL_CCB_GET_LAST_ERRORS == 1)
/**
  * @brief  Return the CCB handle error code.
  * @param  hccb pointer to @ref hal_ccb_handle_t structure.
  * @retval uint32_t CCB last error codes.
  */
uint32_t HAL_CCB_GetLastErrorCodes(const hal_ccb_handle_t *hccb)
{
  ASSERT_DBG_PARAM(hccb != NULL);

  return (hccb->last_error_codes);
}
#endif /* USE_HAL_CCB_GET_LAST_ERRORS */
/**
  * @}
  */

#if defined (USE_HAL_CCB_USER_DATA) && (USE_HAL_CCB_USER_DATA == 1)
/**
  * @brief Store the user data into the CCB handle.
  * @param hccb        pointer to @ref hal_ccb_handle_t structure.
  * @param p_user_data pointer to the user data
  */
void HAL_CCB_SetUserData(hal_ccb_handle_t *hccb, const void *p_user_data)
{
  ASSERT_DBG_PARAM(hccb != NULL);
  ASSERT_DBG_PARAM(p_user_data != NULL);

  hccb->p_user_data = p_user_data;
}

/**
  * @brief  Retrieve the user data from the CCB handle.
  * @param  hccb Pointer to CCB handle
  * @retval Pointer to the user data
  */
const void *HAL_CCB_GetUserData(const hal_ccb_handle_t *hccb)
{
  ASSERT_DBG_PARAM(hccb != NULL);

  return (hccb->p_user_data);
}
#endif /* USE_HAL_CCB_USER_DATA */
/**
  * @}
  */


/** @addtogroup CCB_Private_Functions
  * @{
  */
/**
  * @brief  Set PKA Operation Mode.
  * @param  p_pka_instance  PKA instance
  * @param  operation       PKA Operation
  * @retval HAL_ERROR       Error detected
  * @retval HAL_OK          Initialization completes successfully
  */
static hal_status_t CCB_PKA_SetOperation(PKA_TypeDef *p_pka_instance, uint32_t operation)
{
  uint32_t ccb_pka_mode;

  LL_PKA_Enable(p_pka_instance);

  if (CCB_PKA_WaitFlag(p_pka_instance, PKA_SR_INITOK) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Reset any pending flag */
  STM32_SET_BIT(p_pka_instance->CLRFR, PKA_CLRFR_PROCENDFC | PKA_CLRFR_RAMERRFC
                | PKA_CLRFR_ADDRERRFC | PKA_CLRFR_OPERRFC);

  switch (operation)
  {
    case CCB_ECDSA_SIGN_CPU_BLOB_CREATION:
    case CCB_ECDSA_SIGN_RNG_BLOB_CREATION:
    case CCB_ECDSA_SIGN_BLOB_USE:
    {
      ccb_pka_mode = CCB_PKA_ECDSA_SIGNATURE_PROTECT_MODE;
      break;
    }

    case CCB_ECC_SCALAR_MUL_CPU_BLOB_CREATION:
    case CCB_ECC_SCALAR_MUL_RNG_BLOB_CREATION:
    case CCB_ECC_SCALAR_MUL_BLOB_USE:
    {
      ccb_pka_mode = CCB_PKA_ECC_MUL_PROTECT_MODE;
      break;
    }

    default:
    {
      ccb_pka_mode = CCB_PKA_MODULAR_EXP_PROTECT_MODE;
      break;
    }
  }

  STM32_MODIFY_REG(p_pka_instance->CR, PKA_CR_MODE | PKA_CR_PROCENDIE | PKA_CR_RAMERRIE | PKA_CR_ADDRERRIE
                   | PKA_CR_OPERRIE, ccb_pka_mode);
  return HAL_OK;
}

/**
  * @brief  Unprotected PKA Initialization.
  * @param  p_pka_instance  PKA instance
  * @retval HAL_ERROR       Error detected
  * @retval HAL_OK          Initialization completes successfully
  */
static hal_status_t CCB_PKA_Init(PKA_TypeDef *p_pka_instance)
{
  /* Reset the control register and enable the PKA (wait the end of PKA RAM erase) */
  LL_PKA_Enable(p_pka_instance);

  /* Wait the INITOK flag Setting */
  if (CCB_PKA_WaitFlag(p_pka_instance, PKA_SR_INITOK) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Reset any pending flag */
  STM32_SET_BIT(p_pka_instance->CLRFR, PKA_CLRFR_PROCENDFC | PKA_CLRFR_RAMERRFC
                | PKA_CLRFR_ADDRERRFC | PKA_CLRFR_OPERRFC);

  return HAL_OK;
}

/**
  * @brief  Initialize the RNG.
  * @param  p_rng_instance  RNG instance
  * @retval HAL_ERROR       Error detected
  * @retval HAL_OK          Initialization completes successfully
  */
static hal_status_t CCB_RNG_Init(RNG_TypeDef *p_rng_instance)
{
  uint32_t tickstart;

  /* Disable RNG */
  LL_RNG_Disable(p_rng_instance);
  /* Clock Error Detection Configuration when CONDRT bit is 1U to 1 */
  LL_RNG_EnableCondReset(p_rng_instance);
#if defined(RNG_CR_NIST_VALUE)
  /* Recommended value for NIST compliance, refer to application note AN4230 */
  STM32_WRITE_REG(p_rng_instance->CR, RNG_CR_NIST_VALUE | RNG_CR_CONDRST);
#endif /* defined(RNG_CR_NIST_VALUE) */
#if defined(RNG_HTCR_NIST_VALUE)
  /* Recommended value for NIST compliance, refer to application note AN4230 */
  LL_RNG_SetHealthConfig(p_rng_instance, RNG_HTCR_NIST_VALUE);
#endif /* defined(RNG_HTCR_NIST_VALUE) */
#if defined(RNG_NSCR_NIST_VALUE)
  STM32_WRITE_REG(p_rng_instance->NSCR, RNG_NSCR_NIST_VALUE);
#endif /* defined(RNG_NSCR_NIST_VALUE) */

  LL_RNG_DisableCondReset(p_rng_instance);

  tickstart = HAL_GetTick();

  while (LL_RNG_IsEnabledCondReset(p_rng_instance) == 1U)
  {
    if ((HAL_GetTick() - tickstart) > CCB_GENERAL_TIMEOUT_MS)
    {
      if (LL_RNG_IsEnabledCondReset(p_rng_instance) == 1U)
      {
        return HAL_ERROR;
      }
    }
  }

  LL_RNG_Enable(p_rng_instance);


  /* Check if data register contains valid random data */
  if (CCB_RNG_WaitFlag(p_rng_instance, RNG_SR_DRDY) != HAL_OK)
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Wait CCB Operation step.
  * @param  p_ccb_instance  CCB instance
  * @param  step            Step to wait
  * @retval HAL_ERROR       Error detected
  * @retval HAL_OK          Operation is successfully accomplished
  */
static hal_status_t CCB_WaitOperStep(CCB_TypeDef const *p_ccb_instance, uint32_t step)
{
  uint32_t tickstart;

  tickstart = HAL_GetTick();

  while ((STM32_READ_REG(p_ccb_instance->SR) & step) != step)
  {
    if ((HAL_GetTick() - tickstart) > CCB_GENERAL_TIMEOUT_MS)
    {
      if ((STM32_READ_REG(p_ccb_instance->SR) & step) != step)
      {
        return HAL_ERROR;
      }
    }
  }

  return HAL_OK;
}

/**
  * @brief  Wait CCB Flag.
  * @param  p_ccb_instance  CCB instance
  * @param  flag            Specifies the flag to check
  * @retval HAL_ERROR       Error detected
  * @retval HAL_OK          Operation is successfully accomplished
  */
static hal_status_t CCB_WaitFLAG(CCB_TypeDef const *p_ccb_instance, uint32_t flag)
{
  uint32_t tickstart = HAL_GetTick();

  while (((p_ccb_instance->SR) & flag) == flag)
  {
    if ((HAL_GetTick() - tickstart) > CCB_GENERAL_TIMEOUT_MS)
    {
      if (((p_ccb_instance->SR) & flag) == flag)
      {
        return HAL_ERROR;
      }
    }
  }

  return HAL_OK;
}

/**
  * @brief  Wait PKA Flag.
  * @param  p_pka_instance  PKA instance
  * @param  flag            Specifies the flag to check
  * @retval HAL_ERROR       Error detected
  * @retval HAL_OK          Operation is successfully accomplished
  */
static hal_status_t CCB_PKA_WaitFlag(PKA_TypeDef *p_pka_instance, uint32_t flag)
{
  uint32_t tickstart = HAL_GetTick();

