MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_ccb.c
  while ((LL_PKA_IsActiveFlag(p_pka_instance, flag)) == 0U)
  {
#if defined (USE_HAL_CCB_RNG_RECOVERY) && (USE_HAL_CCB_RNG_RECOVERY == 1U)
#if defined(RNG_HTSR0_RPERRX) || defined(RNG_HTSR1_ADERRX)
    if ((flag == PKA_SR_INITOK) && (LL_PKA_IsActiveFlag(p_pka_instance, PKA_SR_INITOK) == 0U))
    {
      /*Check if there is an RNG seed error */
      if (LL_RNG_IsActiveFlag_SECS(RNG) != 0U)
      {
        /* Attempt to recover from the seed error */
        if (CCB_RNG_ResilientRecoverSeedError() != HAL_OK)
        {
          return HAL_ERROR;
        }
      }
    }
#endif /* RNG_HTSR0_RPERRX || RNG_HTSR1_ADERRX */
#endif /* USE_HAL_CCB_RNG_RECOVERY */

    if ((HAL_GetTick() - tickstart) > CCB_GENERAL_TIMEOUT_MS)
    {
      if ((LL_PKA_IsActiveFlag(p_pka_instance, flag)) == 0U)
      {
        LL_PKA_Disable(p_pka_instance);
        return HAL_ERROR;
      }
    }
  }

  LL_PKA_ClearFlag(p_pka_instance, flag);

  return HAL_OK;
}

/**
  * @brief  Wait RNG Flag.
  * @param  p_rng_instance  RNG instance
  * @param  flag            Specifies the flag to check
  * @retval HAL_ERROR       Error detected
  * @retval HAL_OK          Operation is successfully accomplished
  */
static hal_status_t CCB_RNG_WaitFlag(RNG_TypeDef *p_rng_instance, uint32_t flag)
{
  uint32_t tickstart = HAL_GetTick();
  while (((STM32_READ_REG(p_rng_instance->SR)) & flag) == 0U)
  {
#if defined (USE_HAL_CCB_RNG_RECOVERY) && (USE_HAL_CCB_RNG_RECOVERY == 1U)
#if defined(RNG_HTSR0_RPERRX) || defined(RNG_HTSR1_ADERRX)
    /*Check if there is an RNG seed error */
    if ((LL_RNG_IsActiveFlag_SECS(RNG) != 0U) || (LL_RNG_IsActiveFlag_SEIS(RNG) != 0U))
    {
      /* Attempt to recover from the seed error */
      if (CCB_RNG_ResilientRecoverSeedError() != HAL_OK)
      {
        return HAL_ERROR;
      }
    }
#endif /* RNG_HTSR0_RPERRX || RNG_HTSR1_ADERRX */
#endif /* USE_HAL_CCB_RNG_RECOVERY */

    if ((HAL_GetTick() - tickstart) > CCB_GENERAL_TIMEOUT_MS)
    {
      if (((STM32_READ_REG(p_rng_instance->SR)) & flag) == 0U)
      {
        LL_RNG_Disable(p_rng_instance);
        return HAL_ERROR;
      }
    }
  }
  return HAL_OK;
}

/**
  * @brief  Wait SAES Flag.
  * @param  p_saes_instance  SAES instance
  * @param  flag             Specifies the flag to check
  * @param  status           Flag status
  * @retval HAL_ERROR        Error detected
  * @retval HAL_OK           Operation is successfully accomplished
  */
static hal_status_t CCB_SAES_WaitFlag(AES_TypeDef *p_saes_instance, uint32_t flag, uint32_t status)
{
  uint32_t tickstart = HAL_GetTick();

  while (CCB_SAES_GetFlag(p_saes_instance, flag) != status)
  {
#if defined (USE_HAL_CCB_RNG_RECOVERY) && (USE_HAL_CCB_RNG_RECOVERY == 1U)
#if defined(RNG_HTSR0_RPERRX) || defined(RNG_HTSR1_ADERRX)
    if ((flag == AES_SR_BUSY) && (CCB_SAES_GetFlag(p_saes_instance, AES_SR_BUSY) != status))
    {
      /*Check if there is an RNG seed error */
      if (LL_RNG_IsActiveFlag_SECS(RNG) != 0U)
      {
        /* Attempt to recover from the seed error */
        if (CCB_RNG_ResilientRecoverSeedError() != HAL_OK)
        {
          return HAL_ERROR;
        }
      }
    }
#endif /* RNG_HTSR0_RPERRX || RNG_HTSR1_ADERRX */
#endif /* USE_HAL_CCB_RNG_RECOVERY */

    if ((HAL_GetTick() - tickstart) > CCB_GENERAL_TIMEOUT_MS)
    {
      if (CCB_SAES_GetFlag(p_saes_instance, flag) != status)
      {
        STM32_CLEAR_BIT(p_saes_instance->CR, AES_CR_EN);
        return HAL_ERROR;
      }
    }
  }

  STM32_SET_BIT(p_saes_instance->ICR, flag);

  return HAL_OK;
}

/**
  * @brief  Set ECDSA signature parameters in related PKA RAM address.
  * @param  p_in_curve_param   Pointer to a @ref hal_ccb_ecdsa_curve_param_t structure
  * @retval HAL_ERROR          Error detected
  * @retval HAL_OK             Operation is successfully accomplished
  */
static hal_status_t CCB_ECDSASign_SetParam(const hal_ccb_ecdsa_curve_param_t *p_in_curve_param)
{
  AES_TypeDef *p_saes_instance = SAES;
  __IOM uint32_t *pka_ram_u32 = (__IOM uint32_t *)PKA->RAM;

  /* Get the prime order n length */
  pka_ram_u32[PKA_ECDSA_SIGN_IN_ORDER_NB_BITS]
    = CCB_GetOptBitSize_u8(p_in_curve_param->prime_order_size_byte, *(p_in_curve_param->p_prime_order));
  pka_ram_u32[PKA_ECDSA_SIGN_IN_ORDER_NB_BITS + 1U] = 0x0U;
  if (CCB_SAES_WaitFlag(p_saes_instance, AES_ISR_CCF, 1U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Get the modulus p length */
  pka_ram_u32[PKA_ECDSA_SIGN_IN_MOD_NB_BITS] = CCB_GetOptBitSize_u8(p_in_curve_param->modulus_size_byte,
                                                                    *(p_in_curve_param->p_modulus));
  pka_ram_u32[PKA_ECDSA_SIGN_IN_MOD_NB_BITS + 1U] = 0x0U;
  if (CCB_SAES_WaitFlag(p_saes_instance, AES_ISR_CCF, 1U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Get the coefficient a sign */
  pka_ram_u32[PKA_ECDSA_SIGN_IN_A_COEFF_SIGN] = p_in_curve_param->coef_sign_a;
  pka_ram_u32[PKA_ECDSA_SIGN_IN_A_COEFF_SIGN + 1U] = 0x0U;
  if (CCB_SAES_WaitFlag(p_saes_instance, AES_ISR_CCF, 1U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Move the input parameters coefficient |a| to PKA RAM */
  if (CCB_SetParam(p_in_curve_param->modulus_size_byte, PKA_ECDSA_SIGN_IN_A_COEFF,
                   p_in_curve_param->p_abs_coef_a) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Move the input parameters coefficient b to PKA RAM */
  if (CCB_SetParam(p_in_curve_param->modulus_size_byte, PKA_ECDSA_SIGN_IN_B_COEFF,
                   p_in_curve_param->p_coef_b) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Move the input parameters modulus value p to PKA RAM */
  if (CCB_SetParam(p_in_curve_param->modulus_size_byte, PKA_ECDSA_SIGN_IN_MOD_GF,
                   p_in_curve_param->p_modulus) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Move the input parameters prime order n to PKA RAM */
  if (CCB_SetParam(p_in_curve_param->modulus_size_byte, PKA_ECDSA_SIGN_IN_ORDER_N,
                   p_in_curve_param->p_prime_order) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Move the input parameters base point G coordinate x to PKA RAM */
  if (CCB_SetParam(p_in_curve_param->modulus_size_byte, PKA_ECDSA_SIGN_IN_INITIAL_POINT_X,
                   p_in_curve_param->p_point_x) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Move the input parameters base point G coordinate y to PKA RAM */
  if (CCB_SetParam(p_in_curve_param->modulus_size_byte, PKA_ECDSA_SIGN_IN_INITIAL_POINT_Y,
                   p_in_curve_param->p_point_y) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_SAES_WaitFlag(p_saes_instance, AES_SR_BUSY, 0U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Set ECC scalar multiplication parameters in related PKA RAM address.
  * @param  p_in_curve_param  Pointer to a @ref hal_ccb_ecc_mul_curve_param_t structure
  * @retval HAL_ERROR         Error detected
  * @retval HAL_OK            Operation is successfully accomplished
  */
static hal_status_t CCB_ECCMul_SetParam(const hal_ccb_ecc_mul_curve_param_t *p_in_curve_param)
{
  AES_TypeDef *p_saes_instance = SAES;
  __IOM uint32_t *pka_ram_u32 = (__IOM uint32_t *)PKA->RAM;

  /* Get the prime order n length */
  pka_ram_u32[PKA_ECC_SCALAR_MUL_IN_EXP_NB_BITS]
    = CCB_GetOptBitSize_u8(p_in_curve_param->prime_order_size_byte, *(p_in_curve_param->p_prime_order));
  pka_ram_u32[PKA_ECC_SCALAR_MUL_IN_EXP_NB_BITS + 1U] = 0x0U;
  if (CCB_SAES_WaitFlag(p_saes_instance, AES_ISR_CCF, 1U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Get the modulus p length */
  pka_ram_u32[PKA_ECC_SCALAR_MUL_IN_OP_NB_BITS] = CCB_GetOptBitSize_u8(p_in_curve_param->modulus_size_byte,
                                                                       *(p_in_curve_param->p_modulus));
  pka_ram_u32[PKA_ECC_SCALAR_MUL_IN_OP_NB_BITS + 1U] = 0x0U;
  if (CCB_SAES_WaitFlag(p_saes_instance, AES_ISR_CCF, 1U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Get the coefficient a sign */
  pka_ram_u32[PKA_ECC_SCALAR_MUL_IN_A_COEFF_SIGN] = p_in_curve_param->coef_sign_a;
  pka_ram_u32[PKA_ECC_SCALAR_MUL_IN_A_COEFF_SIGN + 1U] = 0x0U;
  if (CCB_SAES_WaitFlag(p_saes_instance, AES_ISR_CCF, 1U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Move the input parameters coefficient |a| to PKA RAM */
  if (CCB_SetParam(p_in_curve_param->modulus_size_byte, PKA_ECC_SCALAR_MUL_IN_A_COEFF,
                   p_in_curve_param->p_abs_coef_a) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Move the input parameters coefficient b to PKA RAM */
  if (CCB_SetParam(p_in_curve_param->modulus_size_byte, PKA_ECC_SCALAR_MUL_IN_B_COEFF,
                   p_in_curve_param->p_coef_b) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Move the input parameters modulus value p to PKA RAM */
  if (CCB_SetParam(p_in_curve_param->modulus_size_byte, PKA_ECC_SCALAR_MUL_IN_MOD_GF,
                   p_in_curve_param->p_modulus) != HAL_OK)
  {
    return HAL_ERROR;
  }

