MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_ccb.c
  /* Move the input parameters prime order n to PKA RAM */
  if (CCB_SetParam(p_in_curve_param->modulus_size_byte, PKA_ECC_SCALAR_MUL_IN_N_PRIME_ORDER,
                   p_in_curve_param->p_prime_order) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_SAES_WaitFlag(p_saes_instance, AES_SR_BUSY, 0U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Set RSA Modular Exponentiation parameters in related PKA RAM address.
  * @param  p_in_curve_param  Pointer to a @ref hal_ccb_rsa_param_t structure
  * @retval HAL_ERROR         Error detected
  * @retval HAL_OK            Operation is successfully accomplished
  */
static hal_status_t CCB_RSAModExp_SetParam(const  hal_ccb_rsa_param_t *p_in_curve_param)
{
  AES_TypeDef *p_saes_instance = SAES;
  __IOM uint32_t *pka_ram_u32 = (__IOM uint32_t *)PKA->RAM;


  /* Get the exp length */
  pka_ram_u32[PKA_MODULAR_EXP_IN_EXP_NB_BITS] = CCB_GetOptBitSize_u8(p_in_curve_param->exp_size_byte,
                                                                     *(p_in_curve_param->p_mod));
  pka_ram_u32[PKA_MODULAR_EXP_IN_EXP_NB_BITS + 1U] = 0x0U;
  if (CCB_SAES_WaitFlag(p_saes_instance, AES_ISR_CCF, 1U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Get the modulus n length */
  pka_ram_u32[PKA_MODULAR_EXP_IN_OP_NB_BITS] = CCB_GetOptBitSize_u8(p_in_curve_param->modulus_size_byte,
                                                                    *(p_in_curve_param->p_mod));
  pka_ram_u32[PKA_MODULAR_EXP_IN_OP_NB_BITS + 4U] = 0x0U;
  if (CCB_SAES_WaitFlag(p_saes_instance, AES_ISR_CCF, 1U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Move the input parameters modulus to PKA RAM */
  if (CCB_SetParam(p_in_curve_param->modulus_size_byte, PKA_MODULAR_EXP_PROTECT_IN_MODULUS,
                   p_in_curve_param->p_mod) != HAL_OK)
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Set CCB parameters.
  * @param  modulus_size_byte Modulus size in bytes
  * @param  dst_address       Destination address
  * @param  p_src             Pointer to the source buffer
  * @retval HAL_ERROR         Error detected
  * @retval HAL_OK            Operation is successfully accomplished
  */
static hal_status_t CCB_SetParam(uint32_t modulus_size_byte, uint32_t dst_address, const uint8_t *p_src)
{
  uint32_t modulus_size_words = (modulus_size_byte + 7UL) >> 3UL;
  uint32_t operand_size = 2UL * (modulus_size_words + 1UL);
  const uint32_t remainder_bytes = (modulus_size_byte) & 7UL;
  const uint32_t max_word_offset = (remainder_bytes != 0U) ? ((operand_size) - 4UL) : ((operand_size) - 2UL);
  uint32_t word_offset;
  AES_TypeDef *p_saes_instance = SAES;
  __IOM uint32_t *pka_ram_u32 = (__IOM uint32_t *)PKA->RAM;

  for (word_offset = 0U; word_offset < max_word_offset; word_offset += CCB_WORDS_PER_BLOCK)
  {
    uint32_t src_index = modulus_size_byte - ((word_offset * CCB_BYTES_PER_WORD) + 1U);
    CCB_Memcpy_u8_to_u64(&pka_ram_u32[dst_address + word_offset], &p_src[src_index]);

    if (CCB_SAES_WaitFlag(p_saes_instance, AES_ISR_CCF, 1U) != HAL_OK)
    {
      return HAL_ERROR;
    }
  }

  if (remainder_bytes != 0U)
  {
    uint32_t src_index = modulus_size_byte - ((word_offset * CCB_BYTES_PER_WORD) + 1U);
    CCB_Memcpy_TailBytesToU64(&pka_ram_u32[dst_address + word_offset], &p_src[src_index],
                              remainder_bytes);
    if (CCB_SAES_WaitFlag(p_saes_instance, AES_ISR_CCF, 1U) != HAL_OK)
    {
      return HAL_ERROR;
    }
    word_offset += CCB_WORDS_PER_BLOCK;
  }

  CCB_PKA_PadEndRam(pka_ram_u32, dst_address + word_offset);

  if (CCB_SAES_WaitFlag(p_saes_instance, AES_ISR_CCF, 1U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  CCB wrapping key configuration.
  * @param  p_unwrapkey_context  Pointer to the context or parameters required by the unwrapkey
  * @param  ccb_operation      Operation
  * @retval HAL_ERROR          Error detected
  * @retval HAL_OK             Operation is successfully accomplished
  */
static hal_status_t CCB_Wrapping_Key_Config(void *p_unwrapkey_context, uint8_t ccb_operation)
{
  AES_TypeDef *p_saes_instance = SAES;
  ccb_hw_unwrap_key_context_t const *ctx = (ccb_hw_unwrap_key_context_t *)p_unwrapkey_context;
  uint32_t key_selection = (ctx->wrapping_key_context == HAL_CCB_KEY_HSW) ? AES_CR_KEYSEL_2 : AES_CR_KEYSEL_0;
  uint32_t saes_cr_value = 0U;

  /* 1. Software Unwrap Key Path */
  if (ctx->ccb_key_type == CCB_KEY_TYPE_SOFTWARE)
  {
    if (CCB_SAES_SW_UnwrapKey(p_saes_instance, p_unwrapkey_context) != HAL_OK)
    {
      return HAL_ERROR;
    }

    switch (ccb_operation)
    {
      case CCB_ECDSA_SIGN_CPU_BLOB_CREATION:
      case CCB_ECDSA_SIGN_RNG_BLOB_CREATION:
      case CCB_ECC_SCALAR_MUL_CPU_BLOB_CREATION:
      case CCB_ECC_SCALAR_MUL_RNG_BLOB_CREATION:
      case CCB_MODULAR_EXP_CPU_BLOB_CREATION:
        saes_cr_value = AES_CR_KEYSIZE | AES_CR_CHMOD_0 | AES_CR_CHMOD_1;
        break;

      default:
        saes_cr_value = AES_CR_KEYSIZE | AES_CR_CHMOD_0 | AES_CR_CHMOD_1
                        | AES_CR_MODE_1;
        break;
    }

    if (CCB_SAES_WaitFlag(p_saes_instance, AES_SR_BUSY, 0U) != HAL_OK)
    {
      return HAL_ERROR;
    }

    STM32_WRITE_REG(p_saes_instance->CR, saes_cr_value);
    return HAL_OK;
  }
  else
  {
    switch (ccb_operation)
    {
      case CCB_ECDSA_SIGN_CPU_BLOB_CREATION:
      case CCB_ECDSA_SIGN_RNG_BLOB_CREATION:
      case CCB_ECC_SCALAR_MUL_CPU_BLOB_CREATION:
      case CCB_ECC_SCALAR_MUL_RNG_BLOB_CREATION:
      case CCB_MODULAR_EXP_CPU_BLOB_CREATION:
        saes_cr_value = key_selection | AES_CR_KEYSIZE | AES_CR_CHMOD_0
                        | AES_CR_CHMOD_1;
        break;

      default:
        saes_cr_value = key_selection | AES_CR_KEYSIZE | AES_CR_CHMOD_0
                        | AES_CR_CHMOD_1 | AES_CR_MODE_1;
        break;
    }

    if (CCB_SAES_WaitFlag(p_saes_instance, AES_SR_BUSY, 0U) != HAL_OK)
    {
      return HAL_ERROR;
    }

    STM32_WRITE_REG(p_saes_instance->CR, saes_cr_value);

    /* HSW Key: Transfer SW Key from TAMP to SAES */
    if (ctx->wrapping_key_context == HAL_CCB_KEY_HSW)
    {
      for (uint32_t k = 0UL; k < 8UL; k++)
      {
        uint32_t tmp = LL_TAMP_BKP_GetRegister(k);
        if (tmp != 0UL)
        {
          return HAL_ERROR;
        }
      }
    }

    if (CCB_SAES_WaitFlag(p_saes_instance, AES_SR_KEYVALID, 1U) != HAL_OK)
    {
      return HAL_ERROR;
    }
  }
  return HAL_OK;
}

/**
  * @brief  Wrap the clear symmetric key.
  * @param  p_ccb_instance          CCB instance
  * @param  p_in_clear_user_key     Pointer to the clear AES key
  * @param  operation               CCB Operation
  * @param  p_wrapping_key_context  Pointer to a @ref hal_ccb_wrapping_sw_key_context_t structure
  * @param  p_out_wrapped_user_key  Pointer to the wrapped user key
  * @retval HAL_ERROR               Error detected
  * @retval HAL_OK                  Operation is successfully accomplished
  */
static hal_status_t CCB_WrapSymmetricKey(CCB_TypeDef *p_ccb_instance, const uint32_t *p_in_clear_user_key,
                                         uint32_t operation,
                                         const hal_ccb_wrapping_sw_key_context_t *p_wrapping_key_context,
                                         uint32_t *p_out_wrapped_user_key)
{
  uint32_t saes_in_count = 0UL;
  uint32_t saes_out_count = 0UL;
  const uint32_t *p_saes_in_buff = p_in_clear_user_key;
  uint32_t *p_ccb_out_buff = p_out_wrapped_user_key;
  AES_TypeDef *p_saes_instance = SAES;

  if (CCB_WaitFLAG(p_ccb_instance, CCB_SR_CCB_BUSY) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Set operation in CCB */
  STM32_MODIFY_REG(p_ccb_instance->CR, CCB_CR_CCOP, operation);

  /* Wait until OPSTEP is set to 0x01 */
  if (CCB_WaitOperStep(p_ccb_instance, 0x01U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Wait for Galois Filter End of Computation */
  if (CCB_SAES_WaitFlag(p_saes_instance, AES_SR_BUSY, 0U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (p_wrapping_key_context->aes_algorithm != HAL_CCB_AES_ECB)
  {
    STM32_WRITE_REG(p_saes_instance->CR,
                    AES_CR_KEYSEL_0 | AES_CR_KMOD_0 | AES_CR_KEYSIZE
                    | AES_CR_CHMOD_0);
  }
  else
  {
    STM32_WRITE_REG(p_saes_instance->CR, AES_CR_KEYSEL_0
                    | AES_CR_KMOD_0 | AES_CR_KEYSIZE);
  }

  /* Wait for Key valid to be 1U */
  if (CCB_SAES_WaitFlag(p_saes_instance, AES_SR_KEYVALID, 1U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Disable the SAES peripheral */
  STM32_CLEAR_BIT(p_saes_instance->CR, AES_CR_EN);

  if (CCB_SAES_WaitFlag(p_saes_instance, AES_SR_BUSY, 0U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* set the operating mode and encryption operating mode*/
  STM32_MODIFY_REG(p_saes_instance->CR, AES_CR_KMOD | AES_CR_MODE,
                   AES_CR_KMOD_0 | 0x0UL);

  if (p_wrapping_key_context->aes_algorithm != HAL_CCB_AES_ECB)
  {
    /* Set initialization vector from wrapping context */
    p_saes_instance->IVR3 = p_wrapping_key_context->p_init_vect[0];
    p_saes_instance->IVR2 = p_wrapping_key_context->p_init_vect[1];
    p_saes_instance->IVR1 = p_wrapping_key_context->p_init_vect[2];
    p_saes_instance->IVR0 = p_wrapping_key_context->p_init_vect[3];
  }

  /* Enable SAES */
  STM32_SET_BIT(p_saes_instance->CR, AES_CR_EN);

