MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_ccb.c
  while (saes_in_count < CCB_SYMMETRIC_KEY_SIZE_WORD)
  {
    for (uint32_t i = 0UL; i < 4UL; i++)
    {
      STM32_WRITE_REG(p_saes_instance->DINR, p_saes_in_buff[saes_in_count]);
      saes_in_count++;
    }

    /* Wait for CCF flag to be raised */
    if (CCB_SAES_WaitFlag(p_saes_instance, AES_ISR_CCF, 1U) != HAL_OK)
    {
      return HAL_ERROR;
    }

    /* Clear CCF Flag */
    STM32_SET_BIT(p_saes_instance->ICR, AES_ICR_CCF);

    /* Read the output block from the output FIFO */
    for (uint32_t i = 0UL; i < 4UL; i++)
    {
      p_ccb_out_buff[saes_out_count] = STM32_READ_REG(p_saes_instance->DOUTR);
      saes_out_count++;
    }
  }

  return HAL_OK;
}

/**
  * @brief  Get optimal number of bits inside an array of u8.
  * @param  byte_number Number of u8 inside the array
  * @param  msb         Most significant uint8_t of the array
  * @retval uint32_t    returned size
  *
  */
static uint32_t CCB_GetOptBitSize_u8(uint32_t byte_number, uint8_t msb)
{
  uint32_t position;

  position = 32UL - __CLZ(msb);

  return (((byte_number - 1UL) * 8UL) + position);
}

/**
  * @brief  Copy uint32_t array to uint8_t array to fit PKA number representation.
  * @param  p_dst   Pointer to destination
  * @param  p_src   Pointer to source
  * @param  size    Number of uint8_t to copy
  */
static void CCB_Memcpy_u32_to_u8(volatile uint8_t *p_dst, const volatile uint32_t *p_src, size_t size)
{
  size_t num_words = size >> 2U;
  size_t rem_bytes = size & 3U;

  /* Apply __REV equivalent */
  for (size_t i = 0U; i < num_words; i++)
  {
    size_t dst_offset = size - 4U - (i << 2);
    uint32_t word = p_src[i];
    p_dst[dst_offset + 0U] = (uint8_t)((word >> 24U) & 0xFFU);
    p_dst[dst_offset + 1U] = (uint8_t)((word >> 16U) & 0xFFU);
    p_dst[dst_offset + 2U] = (uint8_t)((word >> 8U)  & 0xFFU);
    p_dst[dst_offset + 3U] = (uint8_t)(word & 0xFFU);
  }

  /* Manage the buffers not aligned on uint32_t */
  if (rem_bytes != 0U)
  {
    uint32_t word = p_src[num_words];
    for (size_t j = 0U; j < rem_bytes; j++)
    {
      p_dst[rem_bytes - 1U - j] = (uint8_t)((word >> (j << 3)) & 0xFFU);
    }
  }
}

/**
  * @brief  Copy uint8_t array to uint32_t array to fit PKA number representation.
  * @param  p_dst      Pointer to destination.
  * @param  p_src      Pointer to source.
  * @param  size       Number of uint8_t to copy (must be multiple of 4).
  */
static void CCB_Memcpy_u8_to_u32(volatile  uint32_t *p_dst, const volatile  uint8_t *p_src, size_t size)
{
  size_t num_words = (size + 3U) >> 2U;

  for (size_t i = 0U; i < num_words; ++i)
  {
    uint32_t word = 0U;
    for (size_t j = 0U; j < 4U; ++j)
    {
      size_t byte_index = size - (i << 2) - 1U - j;
      if (((i << 2) + j) < size)
      {
        word |= ((uint32_t)p_src[byte_index]) << (j << 3);
      }
    }
    p_dst[i] = word;
  }

  /* Zero padding for the next two words */
  p_dst[num_words] = 0U;
  p_dst[num_words + 1U] = 0U;
}

/**
  * @brief  Copy uint32_t array to uint32_t array.
  * @param  p_dst    Pointer to destination
  * @param  p_src    Pointer to source
  * @param  size     Number of u32 to be handled
  */
static void CCB_Memcpy_u32_to_u32(volatile uint32_t *p_dst, const volatile uint32_t *p_src, size_t size)
{
  for (uint32_t index = 0UL; index < size; index++)
  {
    p_dst[index] = p_src[index];
  }
}

/**
  * @brief  Copy uint8_t array to uint64_t array to fit number representation.
  * @param  p_dst Pointer to destination
  * @param  p_src Pointer to source
  */
static void CCB_Memcpy_u8_to_u64(volatile uint32_t *p_dst, const volatile uint8_t *p_src)
{
  uint32_t word0 = 0U;
  uint32_t word1 = 0U;
  const volatile uint8_t *p_source = p_src;

  for (uint32_t i = 0U; i < 4U; ++i)
  {
    word0 |= ((uint32_t)(*p_source)) << (8U * i);
    --p_source;
  }

  for (uint32_t i = 0U; i < 4U; ++i)
  {
    word1 |= ((uint32_t)(*p_source)) << (8U * i);
    --p_source;
  }
  p_dst[0] = word0;
  p_dst[1] = word1;
}

/**
  * @brief  Copy up to 7 bytes from a uint8_t array into two uint32_t words.
  * @param  p_dst     Pointer to destination
  * @param  p_src     Pointer to source
  * @param  size    Pointer to number of uint8_t to copy
  */
static void CCB_Memcpy_TailBytesToU64(volatile uint32_t *p_dst, const volatile uint8_t *p_src, size_t size)
{
  uint32_t word0 = 0U;
  uint32_t word1 = 0U;
  const volatile uint8_t *p_source = p_src;

  /* Copy up to 4 bytes into word0 (least significant bytes) */
  for (uint32_t i = 0U; (i < 4U) && (i < size); ++i)
  {
    word0 |= ((uint32_t)(*p_source)) << (8U * i);
    --p_source;
  }

  /* Copy next up to 3 bytes into word1 (if size > 4) */
  for (uint32_t i = 4U; i < size; ++i)
  {
    word1 |= ((uint32_t)(*p_source)) << (8U * (i - 4U));
    --p_source;
  }

  p_dst[0] = word0;
  p_dst[1] = word1;
}

/**
  * @brief  Blob Creation initial phase.
  * @param  p_iv              Pointer to the initial vector
  * @param  randoms           Random Number
  * @retval HAL_ERROR         Error detected
  * @retval HAL_OK            Operation is successfully accomplished
  */
static hal_status_t CCB_BlobCreation_InitialPhase(uint32_t *p_iv, uint32_t randoms)
{
  AES_TypeDef *p_saes_instance = SAES;
  RNG_TypeDef *p_rng_instance = RNG;
  PKA_TypeDef const *p_pka_instance = PKA;

  /* Load IVs from RNG to SAES */
  STM32_WRITE_REG(p_saes_instance->IVR0, CCB_IV0_VALUE); /* SAES_IVR0 that must be equal to 0x2 */

  if (CCB_RNG_WaitFlag(p_rng_instance, RNG_SR_DRDY) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* For IV1, IV2 and IV3, random generated values are loaded from RNG to SAES by CCB */
  STM32_WRITE_REG(p_saes_instance->IVR1, CCB_FAKE_VALUE);
  if (CCB_RNG_WaitFlag(p_rng_instance, RNG_SR_DRDY) != HAL_OK)
  {
    return HAL_ERROR;
  }

  STM32_WRITE_REG(p_saes_instance->IVR2, CCB_FAKE_VALUE);
  if (CCB_RNG_WaitFlag(p_rng_instance, RNG_SR_DRDY) != HAL_OK)
  {
    return HAL_ERROR;
  }

  STM32_WRITE_REG(p_saes_instance->IVR3, CCB_FAKE_VALUE);
  if (CCB_RNG_WaitFlag(p_rng_instance, RNG_SR_DRDY) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* if an error occurs, RNGERRF flag is 1U in PKA */
  if (CCB_GET_PKA_FLAG(p_pka_instance, PKA_SR_RNGERRF) == 1U)
  {
    return HAL_ERROR;
  }

  /* Read back IVs from SAES */
  p_iv[3] = (STM32_READ_REG(p_saes_instance->IVR3) ^ randoms);
  p_iv[2] = (STM32_READ_REG(p_saes_instance->IVR2) ^ randoms);
  p_iv[1] = (STM32_READ_REG(p_saes_instance->IVR1) ^ randoms);
  p_iv[0] = (STM32_READ_REG(p_saes_instance->IVR0) ^ randoms);
  /* Set EN in SAES_CR*/
  STM32_SET_BIT(p_saes_instance->CR, AES_CR_EN);
  /* Wait until CCF is 1U in SAES_ISR (end of GCM init) */
  if (CCB_SAES_WaitFlag(p_saes_instance, AES_ISR_CCF, 1U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_SAES_WaitFlag(p_saes_instance, AES_SR_BUSY, 0U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Set SAES GCMPH Header phase and trig OPSTEP transition 0x2 --> 0x3 */
  STM32_MODIFY_REG(p_saes_instance->CR, AES_CR_CPHASE,
                   AES_CR_CPHASE_0 | AES_CR_EN);

  return HAL_OK;
}


/**
  * @brief  Blob usage initial phase.
  * @param  p_ccb_instance    CCB instance
  * @param  p_iv              Pointer to the initial vector
  * @param  p_tag             Pointer to the tag
  * @param  randoms           Random Number
  * @retval HAL_ERROR         Error detected
  * @retval HAL_OK            Operation is successfully accomplished
  */
static hal_status_t CCB_BlobUse_InitialPhase(CCB_TypeDef *p_ccb_instance, const uint32_t *p_iv, uint32_t *p_tag,
                                             uint32_t randoms)
{
  AES_TypeDef *p_saes_instance = SAES;

  /* Set IVs from created Blob */
  STM32_WRITE_REG(p_saes_instance->IVR0, (p_iv[0] ^ randoms));
  STM32_WRITE_REG(p_saes_instance->IVR1, (p_iv[1] ^ randoms));
  STM32_WRITE_REG(p_saes_instance->IVR2, (p_iv[2] ^ randoms));
  STM32_WRITE_REG(p_saes_instance->IVR3, (p_iv[3] ^ randoms));

  /* Set EN bit in SAES_CR*/
  STM32_SET_BIT(p_saes_instance->CR, AES_CR_EN);

  /* Wait until CCF is 1U in SAES_ISR (end of GCM init) */
  if (CCB_SAES_WaitFlag(p_saes_instance, AES_ISR_CCF, 1U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Write reference tag in CCB */
  for (uint16_t count = 0U; count < CCB_BLOCK_SIZE_WORD ; count++)
  {
    STM32_WRITE_REG(p_ccb_instance->REFTAGR[count], (p_tag[count] ^ randoms));
  }

  if (CCB_SAES_WaitFlag(p_saes_instance, AES_SR_BUSY, 0U) != HAL_OK)
  {
    return HAL_ERROR;
  }

