MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_ccb.c
  /* Set SAES GCMPH Header phase and trig OPSTEP transition 0x12 --> 0x13 */
  STM32_MODIFY_REG(p_saes_instance->CR, AES_CR_CPHASE | AES_CR_EN,
                   AES_CR_CPHASE_0 | AES_CR_EN);

  return HAL_OK;
}

/**
  * @brief  Blob creation initial phase.
  * @param  operation       CCB Operation
  * @param  p_tag           Pointer to the tag
  * @param  size_param      size of parameter
  * @param  randoms         Random Number
  * @retval HAL_ERROR       Error detected
  * @retval HAL_OK          Operation is successfully accomplished
  */
static hal_status_t CCB_BlobCreation_FinalPhase(uint32_t operation, uint32_t *p_tag, uint32_t size_param,
                                                uint32_t randoms)
{
  uint32_t last_block[4U] = {0};
  uint32_t operand_size = 2UL * (((size_param + 7UL) >> 3UL) + 1UL);
  const uint32_t cipherkey_size = ((operand_size & 3U) != 0U) ? (operand_size - 2U) : operand_size;
  AES_TypeDef *p_saes_instance = SAES;

  CCB_CLEAR_PKA_FLAG(PKA, PKA_CLRFR_CMFC);

  /* Preparing last Block */
  switch (operation)
  {
    case CCB_MODULAR_EXP_CPU_BLOB_CREATION:
      /* bitsize of exp length, modulus n length  and modulus (address and data)*/
      last_block[1] = ((64UL * 2UL) + (operand_size * 32UL)) * 2UL;
      last_block[3] = cipherkey_size * 32UL;
      break;
    case CCB_ECDSA_SIGN_CPU_BLOB_CREATION:
    case CCB_ECDSA_SIGN_RNG_BLOB_CREATION:
      /* bitsize of |a|, b, p, n, Gx and Gy --> size_param*8*6*2 (address and data); n length,
         plength and a sign --> 64*3*2 (address and data) */
      last_block[1] = (((operand_size * 32UL) * 6UL) + (3UL * 64UL)) * 2UL;
      last_block[3] = cipherkey_size * 32UL;
      break;
    default:
      /* bitsize of |a|, b, p, n, --> size_param*8*4*2 (address and data); n length,
         plength and a sign --> 64*3*2 (address and data) */
      last_block[1] = (((operand_size * 32UL) * 4UL) + (3UL * 64UL)) * 2UL;
      /* Set ciphered data with size 256 */
      last_block[3] = cipherkey_size * 32UL;
      break;
  }

  for (uint16_t count = 0U; count < CCB_BLOCK_SIZE_WORD ; count++)
  {
    STM32_WRITE_REG(p_saes_instance->DINR, last_block[count]);
  }

  /* Wait until CCF flag is Set in SAES */
  if (CCB_SAES_WaitFlag(p_saes_instance, AES_ISR_CCF, 1U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Read authentication tag */
  for (uint16_t count = 0U; count < CCB_BLOCK_SIZE_WORD ; count++)
  {
    p_tag[count] = (STM32_READ_REG(p_saes_instance->DOUTR) ^ randoms);
  }

  return HAL_OK;
}

/**
  * @brief  Blob usage final phase.
  * @param  p_saes_instance   SAES instance
  * @param  operation         CCB Operation
  * @param  size_param        Size of parameter
  * @retval HAL_ERROR         Error detected
  * @retval HAL_OK            Operation is successfully accomplished
  */
static hal_status_t CCB_BlobUse_FinalPhase(AES_TypeDef *p_saes_instance, uint32_t operation,
                                           uint32_t size_param)
{
  uint32_t last_block[4U] = {0};
  uint32_t operand_size = 2UL * (((size_param + 7UL) >> 3UL) + 1UL);
  const uint32_t cipherkey_size = ((operand_size & 3U) != 0U) ? (operand_size - 2U) : operand_size;

  if (CCB_SAES_WaitFlag(p_saes_instance, AES_SR_BUSY, 0U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Set SAES GCMPH final phase */
  STM32_MODIFY_REG(p_saes_instance->CR, AES_CR_CPHASE, AES_CR_CPHASE_0
                   | AES_CR_CPHASE_1);

  /* Preparing last Block */
  switch (operation)
  {
    case CCB_MODULAR_EXP_BLOB_USE:
      /* bitsize of exp length, modulus n length  and modulus (address and data)*/
      last_block[1] = ((64UL * 2UL) + (operand_size * 32UL)) * 2UL;
      /* Ciphered data size */
      last_block[3] = cipherkey_size * 32UL;
      break;
    case CCB_ECDSA_SIGN_BLOB_USE:
      /* bitsize of |a|, b, p, n, Gx and Gy --> size_param*8*6*2 (address and data); n length,
         plength and a sign --> 64*3*2 (address and data) */
      last_block[1] = (((operand_size * 32UL) * 6UL) + (3UL * 64UL)) * 2UL;
      /* One ciphered data block with size 256 */
      last_block[3] = cipherkey_size * 32UL;
      break;
    default:
      /* bitsize of |a|, b, p, n, --> size_param*8*4*2 (address and data); n length,
         plength and a sign --> 64*3*2 (address and data) */
      last_block[1] = (((operand_size * 32UL) * 4UL) + (3UL * 64UL)) * 2UL;
      /* One ciphered data block with size 256 */
      last_block[3] = cipherkey_size * 32UL;
      break;
  }

  for (uint16_t count = 0U; count < CCB_BLOCK_SIZE_WORD ; count++)
  {
    STM32_WRITE_REG(p_saes_instance->DINR, last_block[count]);
  }

  /* Wait until CCF flag is 1U in SAES  */
  if (CCB_SAES_WaitFlag(p_saes_instance, AES_ISR_CCF, 1U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Read authentication tag and check blob integrity as the event that triggers OPSTEP transition 0x17 --> 0x18 */
  for (uint16_t count = 0U; count < CCB_BLOCK_SIZE_WORD ; count++)
  {
    if (STM32_READ_REG(p_saes_instance->DOUTR) != 0UL)
    {
      return HAL_ERROR;
    }
  }

  /* Return function status */
  return HAL_OK;
}


/**
  * @brief  Blob creation for ECDSA Signature.
  * @param  p_ccb_instance        CCB instance
  * @param  p_in_curve_param      Pointer to a @ref hal_ccb_ecdsa_curve_param_t structure
  * @param  p_unwrapkey_context     Pointer to the context or parameters required by the unwrapkey
  * @param  p_clear_private_key   Pointer to the p_clear_private_key
  * @param  p_iv                  Pointer to the initial vector
  * @param  p_tag                 Pointer to the tag
  * @param  p_wrapped_key         Pointer to the wrapped key
  * @param  randoms               Random Number
  * @param  p_hash                Pointer to the hash
  * @param  p_signature           Pointer to the signature
  * @param  ccb_operation         CCB Operation
  * @retval HAL_ERROR             Error detected
  * @retval HAL_OK                Operation is successfully accomplished
  */
static hal_status_t CCB_ECDSA_SignBlobCreation(CCB_TypeDef *p_ccb_instance,
                                               const hal_ccb_ecdsa_curve_param_t *p_in_curve_param,
                                               void *p_unwrapkey_context, const uint8_t *p_clear_private_key,
                                               uint32_t *p_iv, uint32_t *p_tag, uint32_t *p_wrapped_key,
                                               uint32_t randoms, uint8_t *p_hash, hal_ccb_ecdsa_sign_t *p_signature,
                                               uint8_t ccb_operation)
{
  uint32_t operand_size = 2UL * (((p_in_curve_param->modulus_size_byte + 7UL) >> 3UL) + 1UL);
  AES_TypeDef *p_saes_instance = SAES;
  PKA_TypeDef *p_pka_instance = PKA;
  __IOM uint32_t *pka_ram_u32 = (__IOM uint32_t *)p_pka_instance->RAM;

  if (CCB_WaitFLAG(p_ccb_instance, CCB_SR_CCB_BUSY) != HAL_OK)
  {
    return HAL_ERROR;
  }
  /* Set operation in CCB */
  STM32_MODIFY_REG(p_ccb_instance->CR, CCB_CR_CCOP, ccb_operation);

  /* Wait until OPSTEP is set to 0x01 */
  if (CCB_WaitOperStep(p_ccb_instance, 0x01U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_PKA_SetOperation(p_pka_instance, ccb_operation) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Move the input hash value to PKA RAM */
  CCB_Memcpy_u8_to_u32(&pka_ram_u32[PKA_ECDSA_SIGN_IN_HASH_E ], p_hash,
                       p_in_curve_param->prime_order_size_byte);
  CCB_PKA_PadEndRam(pka_ram_u32, PKA_ECDSA_SIGN_IN_HASH_E  + ((p_in_curve_param->prime_order_size_byte + 3UL) >> 2UL));

  if (CCB_SAES_WaitFlag(p_saes_instance, AES_SR_BUSY, 0U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_Wrapping_Key_Config(p_unwrapkey_context, ccb_operation) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_WaitOperStep(p_ccb_instance, 0x02U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_BlobCreation_InitialPhase(p_iv, randoms) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_WaitOperStep(p_ccb_instance, 0x03U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_ECDSASign_SetParam(p_in_curve_param) != HAL_OK)
  {
    return HAL_ERROR;
  }

