MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_ccb.c
  /* Wait until OPSTEP is set to 0x14 */
  if (CCB_WaitOperStep(p_ccb_instance, 0x14U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_WriteWrappedKey((uint16_t)PKA_ECDSA_SIGN_IN_K, p_wrapped_key, p_in_curve_param->prime_order_size_byte,
                          randoms) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_BlobUse_FinalPhase(p_saes_instance, CCB_ECDSA_SIGN_BLOB_USE,
                             p_in_curve_param->modulus_size_byte) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_WaitOperStep(p_ccb_instance, 0x18U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Set PKA START operation bit and trig OPSTEP transition 0x18 --> 0x19 */
  LL_PKA_Start(p_pka_instance);

  /* Wait until end of operation flag is 1U in PKA and trig OPSTEP transition 0x19 --> 0x1A */
  if (CCB_PKA_WaitFlag(p_pka_instance, PKA_SR_PROCENDF) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Wait until OPSTEP is set to 0x1A */
  if (CCB_WaitOperStep(p_ccb_instance, 0x1AU) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Check PKA Operation error result */
  if ((uint32_t)CCB_PKA_RAM_WORD_ACCESS(p_pka_instance, PKA_ECC_SCALAR_MUL_OUT_ERROR) != CCB_PKA_RESULT_OK)
  {
    return HAL_ERROR;
  }

  /* P coordinate x */
  CCB_Memcpy_u32_to_u8(p_output_point->p_point_x, &pka_ram_u32[PKA_POINT_CHECK_IN_INITIAL_POINT_X],
                       p_in_curve_param->modulus_size_byte);

  /* P coordinate y */
  CCB_Memcpy_u32_to_u8(p_output_point->p_point_y, &pka_ram_u32[PKA_POINT_CHECK_IN_INITIAL_POINT_Y],
                       p_in_curve_param->modulus_size_byte);

  return HAL_OK;
}

/**
  * @brief  Blob Usage: ECDSA Signature.
  * @param  p_ccb_instance      CCB instance
  * @param  p_in_curve_param    Pointer to a @ref hal_ccb_ecdsa_curve_param_t structure
  * @param  p_unwrapkey_context   Pointer to the context or parameters required by the unwrapkey
  * @param  p_in_ecdsa_key_blob Pointer to a @ref hal_ccb_ecdsa_key_blob_t structure
  * @param  p_in_hash           Pointer to the hash
  * @param  hash_size           Specify the size of the hash message
  * @param  p_out_signature     Pointer to the signature
  * @retval HAL_ERROR           Error detected
  * @retval HAL_OK              Operation is successfully accomplished
  */
static hal_status_t CCB_ECDSA_Sign(CCB_TypeDef *p_ccb_instance, const hal_ccb_ecdsa_curve_param_t *p_in_curve_param,
                                   void *p_unwrapkey_context, hal_ccb_ecdsa_key_blob_t *p_in_ecdsa_key_blob,
                                   const uint8_t *p_in_hash, uint8_t hash_size, hal_ccb_ecdsa_sign_t *p_out_signature)
{
  uint32_t word_offset;
  uint32_t operand_size;
  AES_TypeDef *p_saes_instance = SAES;
  PKA_TypeDef *p_pka_instance = PKA;
  RNG_TypeDef *p_rng_instance = RNG;
  __IOM uint32_t *pka_ram_u32 = (__IOM uint32_t *)p_pka_instance->RAM;

  if (CCB_WaitFLAG(p_ccb_instance, CCB_SR_CCB_BUSY) != HAL_OK)
  {
    return HAL_ERROR;
  }
  /* Set operation in CCB */
  STM32_MODIFY_REG(p_ccb_instance->CR, CCB_CR_CCOP, CCB_ECDSA_SIGN_BLOB_USE);

  /* Wait until OPSTEP is set to 0x01 */
  if (CCB_WaitOperStep(p_ccb_instance, 0x01U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_PKA_SetOperation(p_pka_instance, CCB_ECDSA_SIGN_BLOB_USE) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Wait for Galois Filter End of Computation */
  if (CCB_SAES_WaitFlag(p_saes_instance, AES_SR_BUSY, 0U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_Wrapping_Key_Config(p_unwrapkey_context, CCB_ECDSA_SIGN_BLOB_USE) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Wait until OPSTEP is set to 0x012 */
  if (CCB_WaitOperStep(p_ccb_instance, 0x012U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Set Hash message */
  CCB_Memcpy_u8_to_u32(&pka_ram_u32[PKA_ECDSA_SIGN_IN_HASH_E ], p_in_hash, hash_size);

  if (CCB_BlobUse_InitialPhase(p_ccb_instance, p_in_ecdsa_key_blob->p_iv, p_in_ecdsa_key_blob->p_tag, 0U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Wait until OPSTEP is set to 0x13 */
  if (CCB_WaitOperStep(p_ccb_instance, 0x13U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_ECDSASign_SetParam(p_in_curve_param) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Set SAES GCMPH Payload phase and trig OPSTEP that trig OPSTEP transition 0x13 --> 0x14 */
  STM32_MODIFY_REG(p_saes_instance->CR, AES_CR_CPHASE,
                   AES_CR_CPHASE_1);

  /* Wait until OPSTEP is set to 0x14 */
  if (CCB_WaitOperStep(p_ccb_instance, 0x14U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Write encrypted Key*/
  if (CCB_WriteWrappedKey((uint16_t)PKA_ECDSA_SIGN_IN_PRIVATE_KEY_D, p_in_ecdsa_key_blob->p_wrapped_key,
                          p_in_curve_param->prime_order_size_byte, 0U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Wait until DATAOKF flag is 1U in PKA and trig OPSTEP transition 0x14 --> 0x16 */
  if (CCB_PKA_WaitFlag(p_pka_instance, PKA_SR_DATAOKF) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Wait until OPSTEP is set to 0x16 */
  if (CCB_WaitOperStep(p_ccb_instance, 0x16U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Set operand size (in word 32bits)*/
  operand_size = 2UL * ((uint32_t)(((p_in_curve_param->modulus_size_byte) + 7UL) >> 3UL) + 1UL);

  /* Write random k */
  for (word_offset = 0UL; word_offset < (operand_size - 2UL); word_offset++)
  {
    /* Wait for RNG Data Ready flag */
    if (CCB_RNG_WaitFlag(p_rng_instance, RNG_SR_DRDY) != HAL_OK)
    {
      return HAL_ERROR;
    }
    pka_ram_u32[PKA_ECDSA_SIGN_IN_K + word_offset] = CCB_FAKE_VALUE;

  }
  CCB_PKA_PadEndRam(pka_ram_u32, (PKA_ECDSA_SIGN_IN_K + word_offset));
  /* Wait for PKA RNGOK flag : GCMPH = 0x3 (final phase) as events that trig OPSTEP transition 0x16 --> 0x17 */
  if (CCB_PKA_WaitFlag(p_pka_instance, PKA_SR_RNGOKF) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Wait until OPSTEP is set to 0x17 */
  if (CCB_WaitOperStep(p_ccb_instance, 0x17U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_BlobUse_FinalPhase(p_saes_instance, CCB_ECDSA_SIGN_BLOB_USE,
                             p_in_curve_param->modulus_size_byte) != HAL_OK)
  {
    return HAL_ERROR;
  }

