MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_ccb.c
  if (CCB_WaitOperStep(p_ccb_instance, 0x18U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Set PKA START operation bit and trig OPSTEP transition 0x18 --> 0x19 */
  LL_PKA_Start(p_pka_instance);

  /* Wait until end of operation flag is 1U in PKA and trig OPSTEP transition 0x19 --> 0x1A */
  if (CCB_PKA_WaitFlag(p_pka_instance, PKA_SR_PROCENDF) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Wait until OPSTEP is set to 0x1A */
  if (CCB_WaitOperStep(p_ccb_instance, 0x1AU) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if ((uint32_t)CCB_PKA_RAM_WORD_ACCESS(p_pka_instance, PKA_ECDSA_SIGN_OUT_ERROR) != CCB_PKA_RESULT_OK)
  {
    return HAL_ERROR;
  }
  /* Read r part signature */
  CCB_Memcpy_u32_to_u8(p_out_signature->p_r_sign, (__IOM uint32_t *) &pka_ram_u32[PKA_ECDSA_SIGN_OUT_SIGNATURE_R],
                       p_in_curve_param->modulus_size_byte);

  /* Read s part signature */
  CCB_Memcpy_u32_to_u8(p_out_signature->p_s_sign, (__IOM uint32_t *)&pka_ram_u32[PKA_ECDSA_SIGN_OUT_SIGNATURE_S],
                       p_in_curve_param->modulus_size_byte);

  return HAL_OK;
}

/**
  * @brief  Blob creation for ECC Scalar Multiplication.
  * @param  p_ccb_instance         CCB instance
  * @param  p_in_curve_param       Pointer to a @ref hal_ccb_ecc_mul_curve_param_t structure
  * @param  p_unwrapkey_context    Pointer to the context or parameters required by the unwrapkey
  * @param  p_clear_private_key    Pointer to the p_clear_private_key
  * @param  p_iv                   Pointer to the initial vector
  * @param  p_tag                  Pointer to the tag
  * @param  p_wrapped_key          Pointer to the wrapped key
  * @param  randoms                Random Number
  * @param  scalar_mul_x_ref       Buffer for scalar multiplication point x reference
  * @param  scalar_mul_y_ref       Buffer for scalar multiplication point y reference
  * @param  ccb_operation          CCB Operation
  * @retval HAL_ERROR              Error detected
  * @retval HAL_OK                 Operation is successfully accomplished
  */
static hal_status_t CCB_ECC_ScalarMulBlobCreation(CCB_TypeDef *p_ccb_instance,
                                                  const hal_ccb_ecc_mul_curve_param_t *p_in_curve_param,
                                                  void *p_unwrapkey_context, const uint8_t *p_clear_private_key,
                                                  uint32_t *p_iv, uint32_t *p_tag, uint32_t *p_wrapped_key,
                                                  uint32_t randoms, uint32_t *scalar_mul_x_ref,
                                                  uint32_t *scalar_mul_y_ref, uint8_t ccb_operation)
{
  uint32_t operand_size = 2UL * (((p_in_curve_param->prime_order_size_byte + 7UL) >> 3UL) + 1UL);
  AES_TypeDef *p_saes_instance = SAES;
  PKA_TypeDef *p_pka_instance = PKA;
  __IOM uint32_t *pka_ram_u32 = (__IOM uint32_t *)p_pka_instance->RAM;

  if (CCB_WaitFLAG(p_ccb_instance, CCB_SR_CCB_BUSY) != HAL_OK)
  {
    return HAL_ERROR;
  }
  /* Set operation in CCB */
  STM32_MODIFY_REG(p_ccb_instance->CR, CCB_CR_CCOP, ccb_operation);

  /* Wait until OPSTEP is set to 0x01 */
  if (CCB_WaitOperStep(p_ccb_instance, 0x01U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_PKA_SetOperation(p_pka_instance, ccb_operation) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Write  point G coordinate */
  CCB_Memcpy_u8_to_u32(&pka_ram_u32[PKA_ECC_SCALAR_MUL_IN_INITIAL_POINT_X ],
                       p_in_curve_param->p_point_x, p_in_curve_param->prime_order_size_byte);
  CCB_PKA_PadEndRam(pka_ram_u32,
                    PKA_ECC_SCALAR_MUL_IN_INITIAL_POINT_X + ((p_in_curve_param->prime_order_size_byte + 3UL) >> 2UL));
  CCB_Memcpy_u8_to_u32(&pka_ram_u32[PKA_ECC_SCALAR_MUL_IN_INITIAL_POINT_Y ],
                       p_in_curve_param->p_point_y, p_in_curve_param->prime_order_size_byte);
  CCB_PKA_PadEndRam(pka_ram_u32,
                    PKA_ECC_SCALAR_MUL_IN_INITIAL_POINT_Y + ((p_in_curve_param->prime_order_size_byte + 3UL) >> 2UL));

  /* Wait for Galois Filter End of Computation */
  if (CCB_SAES_WaitFlag(p_saes_instance, AES_SR_BUSY, 0U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_Wrapping_Key_Config(p_unwrapkey_context, ccb_operation) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Wait until OPSTEP is set to 0x02 */
  if (CCB_WaitOperStep(p_ccb_instance, 0x02U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_BlobCreation_InitialPhase(p_iv, randoms) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Wait until OPSTEP is set to 0x03 */
  if (CCB_WaitOperStep(p_ccb_instance, 0x03U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_ECCMul_SetParam(p_in_curve_param) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Set SAES GCMPH Payload phase and trig OPSTEP that trig OPSTEP transition 0x3 --> 0x4 */
  STM32_MODIFY_REG(p_saes_instance->CR, AES_CR_CPHASE,
                   AES_CR_CPHASE_1);

  /* Wait until OPSTEP is set to 0x04 */
  if (CCB_WaitOperStep(p_ccb_instance, 0x04U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  CCB_CLEAR_PKA_FLAG(p_pka_instance, PKA_CLRFR_CMFC);

  switch (ccb_operation)
  {
    case CCB_ECC_SCALAR_MUL_CPU_BLOB_CREATION:
      CCB_PKA_WriteClearTextData(pka_ram_u32, (uint16_t)PKA_ECC_SCALAR_MUL_IN_K,
                                 p_clear_private_key, p_in_curve_param->modulus_size_byte, operand_size);

      /* Wait until DATAOKF flag is 1U in PKA and trig OPSTEP transition 0x4 --> 0x8 */
      if (CCB_PKA_WaitFlag(p_pka_instance, PKA_SR_DATAOKF) != HAL_OK)
      {
        return HAL_ERROR;
      }
      break;
    default:
      /* Write scalar k when RNG */
      if (CCB_WriteKeyFromRNG((uint16_t)PKA_ECC_SCALAR_MUL_IN_K, operand_size) != HAL_OK)
      {
        return HAL_ERROR;
      }
      break;
  }

  /* Wait until OPSTEP is set to 0x08 */
  if (CCB_WaitOperStep(p_ccb_instance, 0x08U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  CCB_CLEAR_PKA_FLAG(p_pka_instance, PKA_CLRFR_CMFC);

  /* Read ciphered scalar k */
  if (CCB_ReadCipheredPrivateKey((uint16_t)PKA_ECC_SCALAR_MUL_IN_K, operand_size, p_wrapped_key, randoms) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Set SAES GCMPH final phase */
  STM32_MODIFY_REG(p_saes_instance->CR, AES_CR_CPHASE,
                   AES_CR_CPHASE_0 | AES_CR_CPHASE_1);

  /* Wait until OPSTEP is set to 0x0A */
  if (CCB_WaitOperStep(p_ccb_instance, 0x0AU) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_BlobCreation_FinalPhase(ccb_operation, p_tag, p_in_curve_param->modulus_size_byte, randoms) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Set PKA START operation bit and trig OPSTEP transition 0x0A --> 0x19 */
  LL_PKA_Start(p_pka_instance);

  /* Wait until end of operation flag is 1U in PKA and trig OPSTEP transition 0x19 --> 0x1A */
  if (CCB_PKA_WaitFlag(p_pka_instance, PKA_SR_PROCENDF) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Wait until OPSTEP is set to 0x1A */
  if (CCB_WaitOperStep(p_ccb_instance, 0x1AU) != HAL_OK)
  {
    return HAL_ERROR;
  }

