MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_ccb.c
  /* Check PKA Operation error result */
  if ((uint32_t)CCB_PKA_RAM_WORD_ACCESS(p_pka_instance, PKA_ECC_SCALAR_MUL_OUT_ERROR) != CCB_PKA_RESULT_OK)
  {
    return HAL_ERROR;
  }

  /* Move the result from appropriate location */
  CCB_Memcpy_u32_to_u32(scalar_mul_x_ref, &pka_ram_u32[PKA_ECC_SCALAR_MUL_OUT_RESULT_X],
                        ((p_in_curve_param->modulus_size_byte + 3U) >> 2U));
  CCB_Memcpy_u32_to_u32(scalar_mul_y_ref, &pka_ram_u32[PKA_ECC_SCALAR_MUL_OUT_RESULT_Y],
                        ((p_in_curve_param->modulus_size_byte + 3U) >> 2U));

  return HAL_OK;
}

/**
  * @brief  Blob creation for RSA Modular exponentiation.
  * @param  p_ccb_instance          CCB instance
  * @param  p_param                 Pointer to a @ref hal_ccb_rsa_param_t structure
  * @param  p_unwrapkey_context     Pointer to the context or parameters required by the unwrapkey
  * @param  p_rsa_clear_private_key Pointer to a @ref hal_ccb_rsa_clear_key_t
  * @param  p_iv                    Pointer to the initial vector
  * @param  p_tag                   Pointer to the tag
  * @param  p_wrapped_exp           Pointer to the wrapped exp
  * @param  p_wrapped_phi           Pointer to the wrapped phi
  * @param  randoms                 Random Number
  * @param  p_operand               Pointer to to the constant K as operand A
  * @param  p_reference_modular_exp Pointer to the output reference modular exponentiation
  * @retval HAL_ERROR               Error detected
  * @retval HAL_OK                  Operation is successfully accomplished
  */
static hal_status_t CCB_RSA_ExpBlobCreation(CCB_TypeDef *p_ccb_instance, const hal_ccb_rsa_param_t *p_param,
                                            void *p_unwrapkey_context,
                                            const hal_ccb_rsa_clear_key_t *p_rsa_clear_private_key,
                                            uint32_t *p_iv, uint32_t *p_tag, uint32_t *p_wrapped_exp,
                                            uint32_t *p_wrapped_phi, uint32_t randoms, uint8_t *p_operand,
                                            uint32_t *p_reference_modular_exp)
{
  uint32_t operand_size = 2UL * (((p_param->modulus_size_byte + 7UL) >> 3UL) + 1UL);
  AES_TypeDef *p_saes_instance = SAES;
  PKA_TypeDef *p_pka_instance = PKA;
  __IOM uint32_t *pka_ram_u32 = (__IOM uint32_t *)p_pka_instance->RAM;

  if (CCB_WaitFLAG(p_ccb_instance, CCB_SR_CCB_BUSY) != HAL_OK)
  {
    return HAL_ERROR;
  }
  /* Set operation in CCB */
  STM32_MODIFY_REG(p_ccb_instance->CR, CCB_CR_CCOP, CCB_MODULAR_EXP_CPU_BLOB_CREATION);

  /* Wait until OPSTEP is set to 0x01 */
  if (CCB_WaitOperStep(p_ccb_instance, 0x01U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_PKA_SetOperation(p_pka_instance, CCB_MODULAR_EXP_CPU_BLOB_CREATION) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Write a constant K as operand A (base of exponentiation) in the PKA RAM */
  CCB_Memcpy_u8_to_u32(&pka_ram_u32[PKA_MODULAR_EXP_PROTECT_IN_EXPONENT_BASE ], p_operand,
                       p_param->modulus_size_byte);
  CCB_PKA_PadEndRam(pka_ram_u32,
                    PKA_MODULAR_EXP_PROTECT_IN_EXPONENT_BASE + ((p_param->modulus_size_byte + 3UL) >> 2UL));

  /* Wait for Galois Filter End of Computation */
  if (CCB_SAES_WaitFlag(p_saes_instance, AES_SR_BUSY, 0U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_Wrapping_Key_Config(p_unwrapkey_context, CCB_MODULAR_EXP_CPU_BLOB_CREATION) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Wait until OPSTEP is set to 0x02 */
  if (CCB_WaitOperStep(p_ccb_instance, 0x02U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_BlobCreation_InitialPhase(p_iv, randoms) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Wait until OPSTEP is set to 0x03 */
  if (CCB_WaitOperStep(p_ccb_instance, 0x03U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_RSAModExp_SetParam(p_param) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_SAES_WaitFlag(p_saes_instance, AES_SR_BUSY, 0U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Set SAES GCMPH Payload phase and trig OPSTEP that trig OPSTEP transition 0x3 --> 0x4 */
  STM32_MODIFY_REG(p_saes_instance->CR, AES_CR_CPHASE,
                   AES_CR_CPHASE_1);

  /* Wait until OPSTEP is set to 0x04 */
  if (CCB_WaitOperStep(p_ccb_instance, 0x04U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Clear CMF flag before starting */
  CCB_CLEAR_PKA_FLAG(p_pka_instance, PKA_CLRFR_CMFC);

  /* Write clear-text exponent e */
  CCB_PKA_WriteClearTextData(pka_ram_u32, (uint16_t)PKA_MODULAR_EXP_PROTECT_IN_EXPONENT,
                             p_rsa_clear_private_key->p_exp, p_param->modulus_size_byte, operand_size);

  /* Wait until DATAOKF flag is 1U in PKA and trigger OPSTEP transition 0x4 --> 0x5 */
  if (CCB_PKA_WaitFlag(p_pka_instance, PKA_SR_DATAOKF) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Wait until OPSTEP is set to 0x05 */
  if (CCB_WaitOperStep(p_ccb_instance, 0x05) != HAL_OK)
  {
    return HAL_ERROR;
  }

  CCB_CLEAR_PKA_FLAG(p_pka_instance, PKA_CLRFR_CMFC);

  /* Write clear-text phi */
  CCB_PKA_WriteClearTextData(pka_ram_u32, (uint16_t)PKA_MODULAR_EXP_PROTECT_IN_PHI,
                             p_rsa_clear_private_key->p_phi, p_param->modulus_size_byte, operand_size);

  /* Wait until DATAOKF flag is 1U in PKA and trig OPSTEP transition 0x5 --> 0x8:   */
  if (CCB_PKA_WaitFlag(p_pka_instance, PKA_SR_DATAOKF) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Wait until OPSTEP is set to 0x08 */
  if (CCB_WaitOperStep(p_ccb_instance, 0x08U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  CCB_CLEAR_PKA_FLAG(p_pka_instance, PKA_CLRFR_CMFC);

  /* Read ciphered exponent e */
  if (CCB_ReadCipheredPrivateKey((uint16_t)PKA_MODULAR_EXP_PROTECT_IN_EXPONENT, operand_size, p_wrapped_exp,
                                 randoms) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Wait until OPSTEP is set to 0x09 */
  if (CCB_WaitOperStep(p_ccb_instance, 0x09U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  CCB_CLEAR_PKA_FLAG(p_pka_instance, PKA_CLRFR_CMFC);

  /* Read ciphered phi */
  if (CCB_ReadCipheredPrivateKey((uint16_t)PKA_MODULAR_EXP_PROTECT_IN_PHI, operand_size,
                                 p_wrapped_phi, randoms) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Set SAES GCMPH final phase */
  STM32_MODIFY_REG(p_saes_instance->CR, AES_CR_CPHASE,
                   AES_CR_CPHASE_0 | AES_CR_CPHASE_1);

  /* Wait until OPSTEP is set to 0x0A */
  if (CCB_WaitOperStep(p_ccb_instance, 0x0AU) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Final phase processing */
  if (CCB_BlobCreation_FinalPhase(CCB_MODULAR_EXP_CPU_BLOB_CREATION, p_tag, p_param->modulus_size_byte,
                                  randoms) != HAL_OK)
  {
    return HAL_ERROR;
  }
  /* Set PKA START operation bit and trig OPSTEP transition 0x0A --> 0x19 */
  LL_PKA_Start(p_pka_instance);

  /* Wait until end of operation flag is 1U in PKA and trig OPSTEP transition 0x19 --> 0x1A */
  if (CCB_PKA_WaitFlag(p_pka_instance, PKA_SR_PROCENDF) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Wait until OPSTEP is set to 0x1A */
  if (CCB_WaitOperStep(p_ccb_instance, 0x1AU) != HAL_OK)
  {
    return HAL_ERROR;
  }

