MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_ccb.c
  /* Check PKA Operation error result */
  if ((uint32_t)CCB_PKA_RAM_WORD_ACCESS(p_pka_instance, PKA_MODULAR_EXP_OUT_ERROR) != CCB_PKA_RESULT_OK)
  {
    return HAL_ERROR;
  }

  uint32_t modulus_words_count = (p_param->modulus_size_byte + 3UL) >> 2UL;

  /* Read result output */
  for (uint32_t word_offset = 0U; word_offset < modulus_words_count; word_offset++)
  {
    p_reference_modular_exp[word_offset] = pka_ram_u32[PKA_MODULAR_EXP_OUT_RESULT + word_offset];
  }

  return HAL_OK;
}

/**
  * @brief  Protected ECC compute scalar multiplication.
  * @param  p_ccb_instance         CCB instance
  * @param  p_in_curve_param       Pointer to a @ref hal_ccb_ecdsa_curve_param_t structure
  * @param  p_unwrapkey_context    Pointer to the context or parameters required by the unwrapkey
  * @param  p_iv                   Pointer to the initial vector
  * @param  p_tag                  Pointer to the tag
  * @param  p_wrapped_key          Pointer to the wrapped key
  * @param  randoms                Random Number
  * @param  p_input_point          Pointer to a @ref hal_ccb_ecc_point_t structure
  * @param  p_output_point         Pointer to a @ref hal_ccb_ecc_point_t structure
  * @retval HAL_ERROR              Error detected
  * @retval HAL_OK                 Operation is successfully accomplished
  */
static hal_status_t CCB_ECC_ComputeScalarMul(CCB_TypeDef *p_ccb_instance,
                                             const hal_ccb_ecc_mul_curve_param_t *p_in_curve_param,
                                             void *p_unwrapkey_context, uint32_t *p_iv, uint32_t *p_tag,
                                             uint32_t *p_wrapped_key, uint32_t randoms,
                                             const hal_ccb_ecc_point_t *p_input_point,
                                             hal_ccb_ecc_point_t *p_output_point)
{
  const uint8_t *p_point_x = (p_input_point == NULL) ? p_in_curve_param->p_point_x : p_input_point->p_point_x;
  const uint8_t *p_point_y = (p_input_point == NULL) ? p_in_curve_param->p_point_y : p_input_point->p_point_y;
  AES_TypeDef *p_saes_instance = SAES;
  PKA_TypeDef *p_pka_instance = PKA;
  __IOM uint32_t *pka_ram_u32 = (__IOM uint32_t *)p_pka_instance->RAM;

  if (CCB_WaitFLAG(p_ccb_instance, CCB_SR_CCB_BUSY) != HAL_OK)
  {
    return HAL_ERROR;
  }
  /* Set operation in CCB */
  STM32_MODIFY_REG(p_ccb_instance->CR, CCB_CR_CCOP, CCB_ECC_SCALAR_MUL_BLOB_USE);

  /* Wait until OPSTEP is set to 0x01 */
  if (CCB_WaitOperStep(p_ccb_instance, 0x01U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_PKA_SetOperation(p_pka_instance, CCB_ECC_SCALAR_MUL_BLOB_USE) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Write Customized point coordinate */
  CCB_Memcpy_u8_to_u32(&pka_ram_u32[PKA_ECC_SCALAR_MUL_IN_INITIAL_POINT_X ],
                       p_point_x, p_in_curve_param->modulus_size_byte);
  CCB_PKA_PadEndRam(pka_ram_u32,
                    PKA_ECC_SCALAR_MUL_IN_INITIAL_POINT_X + ((p_in_curve_param->modulus_size_byte + 3UL) >> 2UL));

  CCB_Memcpy_u8_to_u32((&pka_ram_u32[PKA_ECC_SCALAR_MUL_IN_INITIAL_POINT_Y ]),
                       p_point_y, p_in_curve_param->modulus_size_byte);
  CCB_PKA_PadEndRam(pka_ram_u32,
                    PKA_ECC_SCALAR_MUL_IN_INITIAL_POINT_Y + ((p_in_curve_param->modulus_size_byte + 3UL) >> 2UL));

  /* Wait for Galois Filter End of Computation */
  if (CCB_SAES_WaitFlag(p_saes_instance, AES_SR_BUSY, 0U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_Wrapping_Key_Config(p_unwrapkey_context, CCB_ECC_SCALAR_MUL_BLOB_USE) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Wait until OPSTEP is set to 0x012 */
  if (CCB_WaitOperStep(p_ccb_instance, 0x012U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_BlobUse_InitialPhase(p_ccb_instance, p_iv, p_tag, randoms) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Wait until OPSTEP is set to 0x13 */
  if (CCB_WaitOperStep(p_ccb_instance, 0x13U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_ECCMul_SetParam(p_in_curve_param) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Set SAES GCMPH Payload phase and trig OPSTEP that trig OPSTEP transition 0x13 --> 0x14 */
  STM32_MODIFY_REG(p_saes_instance->CR, AES_CR_CPHASE,
                   AES_CR_CPHASE_1);

  /* Wait until OPSTEP is set to 0x14 */
  if (CCB_WaitOperStep(p_ccb_instance, 0x14U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_WriteWrappedKey((uint16_t)PKA_ECDSA_SIGN_IN_K, p_wrapped_key, p_in_curve_param->prime_order_size_byte,
                          randoms) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Final phase processing */
  if (CCB_BlobUse_FinalPhase(p_saes_instance, CCB_ECC_SCALAR_MUL_BLOB_USE,
                             p_in_curve_param->modulus_size_byte) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_WaitOperStep(p_ccb_instance, 0x18U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Set PKA START operation bit and trig OPSTEP transition 0x18 --> 0x19 */
  LL_PKA_Start(p_pka_instance);

  /* Wait until end of operation flag is 1U in PKA and trig OPSTEP transition 0x19 --> 0x1A */
  if (CCB_PKA_WaitFlag(p_pka_instance, PKA_SR_PROCENDF) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Wait until OPSTEP is set to 0x1A */
  if (CCB_WaitOperStep(p_ccb_instance, 0x1AU) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Check PKA Operation error result */
  if ((uint32_t)CCB_PKA_RAM_WORD_ACCESS(p_pka_instance, PKA_ECC_SCALAR_MUL_OUT_ERROR) != CCB_PKA_RESULT_OK)
  {
    return HAL_ERROR;
  }

  if (p_input_point != NULL)
  {
    /* P coordinate x */
    CCB_Memcpy_u32_to_u8(p_output_point->p_point_x, &pka_ram_u32[PKA_ECC_SCALAR_MUL_OUT_RESULT_X],
                         p_in_curve_param->modulus_size_byte);

    /* P coordinate y */
    CCB_Memcpy_u32_to_u8(p_output_point->p_point_y, &pka_ram_u32[PKA_ECC_SCALAR_MUL_OUT_RESULT_Y],
                         p_in_curve_param->modulus_size_byte);

  }
  return HAL_OK;
}

/**
  * @brief  Blob Usage: RSA Compute Modular exponentiation.
  * @param  p_ccb_instance          CCB instance
  * @param  p_param                 Pointer to a @ref hal_ccb_rsa_param_t structure
  * @param  p_unwrapkey_context     Pointer to the context or parameters required by the unwrapkey
  * @param  p_iv                    Pointer to the initial vector
  * @param  p_tag                   Pointer to the tag
  * @param  p_wrapped_exp           Pointer to the wrapped exp
  * @param  p_wrapped_phi           Pointer to the wrapped phi
  * @param  randoms                 Random Number
  * @param  p_operand               Pointer to the operand
  * @param  p_modular_exp           Pointer to the modular exponent
  * @retval HAL_ERROR               Error detected
  * @retval HAL_OK                  Operation is successfully accomplished
  */
static hal_status_t CCB_RSA_ComputeModularExp(CCB_TypeDef *p_ccb_instance, const hal_ccb_rsa_param_t *p_param,
                                              void *p_unwrapkey_context, uint32_t *p_iv,
                                              uint32_t *p_tag, uint32_t *p_wrapped_exp, uint32_t *p_wrapped_phi,
                                              uint32_t randoms, const uint8_t *p_operand, uint8_t *p_modular_exp)
{
  AES_TypeDef *p_saes_instance = SAES;
  PKA_TypeDef *p_pka_instance = PKA;
  __IOM uint32_t *pka_ram_u32 = (__IOM uint32_t *)p_pka_instance->RAM;

  if (CCB_WaitFLAG(p_ccb_instance, CCB_SR_CCB_BUSY) != HAL_OK)
  {
    return HAL_ERROR;
  }
  /* Set operation in CCB */
  STM32_MODIFY_REG(p_ccb_instance->CR, CCB_CR_CCOP, CCB_MODULAR_EXP_BLOB_USE);

  /* Wait until OPSTEP is set to 0x01 */
  if (CCB_WaitOperStep(p_ccb_instance, 0x01U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_PKA_SetOperation(p_pka_instance, CCB_MODULAR_EXP_BLOB_USE) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Wait for Galois Filter End of Computation */
  if (CCB_SAES_WaitFlag(p_saes_instance, AES_SR_BUSY, 0U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_Wrapping_Key_Config(p_unwrapkey_context, CCB_MODULAR_EXP_BLOB_USE) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Wait until OPSTEP is set to 0x012 */
  if (CCB_WaitOperStep(p_ccb_instance, 0x012U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Set Operand A - base of exponentiation */
  CCB_Memcpy_u8_to_u32(&pka_ram_u32[PKA_MODULAR_EXP_PROTECT_IN_EXPONENT_BASE], p_operand,
                       p_param->modulus_size_byte);

  if (CCB_BlobUse_InitialPhase(p_ccb_instance, p_iv, p_tag, randoms) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Wait until OPSTEP is set to 0x13 */
  if (CCB_WaitOperStep(p_ccb_instance, 0x13U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_RSAModExp_SetParam(p_param) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_SAES_WaitFlag(p_saes_instance, AES_SR_BUSY, 0U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Set SAES GCMPH Payload phase and trig OPSTEP that trig OPSTEP transition 0x13 --> 0x14 */
  STM32_MODIFY_REG(p_saes_instance->CR, AES_CR_CPHASE,
                   AES_CR_CPHASE_1);

