MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_ccb.c
  /* Wait until OPSTEP is set to 0x14 */
  if (CCB_WaitOperStep(p_ccb_instance, 0x14U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_WriteWrappedKey((uint16_t)PKA_MODULAR_EXP_PROTECT_IN_EXPONENT, p_wrapped_exp,
                          p_param->modulus_size_byte, randoms) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Wait until DATAOKF flag is 1U in PKA and trig OPSTEP transition 0x14 --> 0x15 */
  if (CCB_PKA_WaitFlag(p_pka_instance, PKA_SR_DATAOKF) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_WaitOperStep(p_ccb_instance, 0x15U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  CCB_CLEAR_PKA_FLAG(p_pka_instance, PKA_CLRFR_CMFC);

  if (CCB_WriteWrappedKey((uint16_t)PKA_MODULAR_EXP_PROTECT_IN_PHI, p_wrapped_phi,
                          p_param->modulus_size_byte, randoms) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Wait until DATAOKF flag is 1U in PKA and trig OPSTEP transition 0x15 --> 0x17 */
  if (CCB_PKA_WaitFlag(p_pka_instance, PKA_SR_DATAOKF) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Wait until OPSTEP is set to 0x17 */
  if (CCB_WaitOperStep(p_ccb_instance, 0x17U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_BlobUse_FinalPhase(p_saes_instance, CCB_MODULAR_EXP_BLOB_USE,
                             p_param->modulus_size_byte) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_WaitOperStep(p_ccb_instance, 0x18U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Set PKA START operation bit and trig OPSTEP transition 0x18 --> 0x19 */
  LL_PKA_Start(p_pka_instance);

  /* Wait until end of operation flag is 1U in PKA and trig OPSTEP transition 0x19 --> 0x1A */
  if (CCB_PKA_WaitFlag(p_pka_instance, PKA_SR_PROCENDF) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Wait until OPSTEP is set to 0x1A */
  if (CCB_WaitOperStep(p_ccb_instance, 0x1AU) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (p_modular_exp != NULL)
  {
    /* Check PKA Operation error result */
    if ((uint32_t)CCB_PKA_RAM_WORD_ACCESS(p_pka_instance, PKA_MODULAR_EXP_OUT_ERROR) != CCB_PKA_RESULT_OK)
    {
      return HAL_ERROR;
    }

    /* Read result output */
    CCB_Memcpy_u32_to_u8(p_modular_exp, &pka_ram_u32[PKA_MODULAR_EXP_OUT_RESULT],
                         p_param->modulus_size_byte);
  }
  return HAL_OK;
}

/**
  * @brief  Verify the validity of a signature using elliptic curves over prime fields in blocking mode.
  * @param  p_pka_instance              PKA instance
  * @param  p_in_curve_param            Pointer to a @ref hal_ccb_ecdsa_curve_param_t structure
  * @param  p_public_key_out            Pointer to a @ref hal_ccb_ecc_point_t structure
  * @param  p_hash                      Pointer to the hash
  * @param  p_signature                 Pointer to a @ref hal_ccb_ecdsa_sign_t structure
  * @retval HAL_ERROR                   Error detected
  * @retval HAL_OK                      Operation is successfully accomplished
  */
static hal_status_t CCB_PKA_ECDSASetConfigVerifSignature(PKA_TypeDef *p_pka_instance,
                                                         const hal_ccb_ecdsa_curve_param_t *p_in_curve_param,
                                                         hal_ccb_ecc_point_t *p_public_key_out, const uint8_t *p_hash,
                                                         hal_ccb_ecdsa_sign_t *p_signature)
{
  __IOM uint32_t *pka_ram_u32 = (__IOM uint32_t *)p_pka_instance->RAM;

  if (CCB_PKA_Init(p_pka_instance) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Get the prime order n length */
  pka_ram_u32[PKA_ECDSA_VERIF_IN_ORDER_NB_BITS] = CCB_GetOptBitSize_u8(p_in_curve_param->prime_order_size_byte,
                                                                       *(p_in_curve_param->p_prime_order));

  /* Get the modulus p length */
  pka_ram_u32[PKA_ECDSA_VERIF_IN_MOD_NB_BITS] = CCB_GetOptBitSize_u8(p_in_curve_param->modulus_size_byte,
                                                                     *(p_in_curve_param->p_modulus));

  /* Get the coefficient a sign */
  pka_ram_u32[PKA_ECDSA_VERIF_IN_A_COEFF_SIGN] = p_in_curve_param->coef_sign_a;

  /* Move the input parameters coefficient |a| to PKA RAM */
  CCB_Memcpy_u8_to_u32(&(pka_ram_u32[PKA_ECDSA_VERIF_IN_A_COEFF]), p_in_curve_param->p_abs_coef_a,
                       p_in_curve_param->modulus_size_byte);

  /* Move the input parameters modulus value p to PKA RAM */
  CCB_Memcpy_u8_to_u32(&(pka_ram_u32[PKA_ECDSA_VERIF_IN_MOD_GF]), p_in_curve_param->p_modulus,
                       p_in_curve_param->modulus_size_byte);

  /* Move the input parameters base point G coordinate x to PKA RAM */
  CCB_Memcpy_u8_to_u32(&(pka_ram_u32[PKA_ECDSA_VERIF_IN_INITIAL_POINT_X]), p_in_curve_param->p_point_x,
                       p_in_curve_param->modulus_size_byte);

  /* Move the input parameters base point G coordinate y to PKA RAM */
  CCB_Memcpy_u8_to_u32(&(pka_ram_u32[PKA_ECDSA_VERIF_IN_INITIAL_POINT_Y]), p_in_curve_param->p_point_y,
                       p_in_curve_param->modulus_size_byte);

  /* Move the input parameters public-key curve point Q coordinate xQ to PKA RAM */
  CCB_Memcpy_u8_to_u32(&(pka_ram_u32[PKA_ECDSA_VERIF_IN_PUBLIC_KEY_POINT_X]), p_public_key_out->p_point_x,
                       p_in_curve_param->modulus_size_byte);

  /* Move the input parameters public-key curve point Q coordinate xQ to PKA RAM */
  CCB_Memcpy_u8_to_u32(&(pka_ram_u32[PKA_ECDSA_VERIF_IN_PUBLIC_KEY_POINT_Y]), p_public_key_out->p_point_y,
                       p_in_curve_param->modulus_size_byte);

  /* Move the input parameters signature part r to PKA RAM */
  CCB_Memcpy_u8_to_u32(&(pka_ram_u32[PKA_ECDSA_VERIF_IN_SIGNATURE_R]), p_signature->p_r_sign,
                       p_in_curve_param->prime_order_size_byte);

  /* Move the input parameters signature part s to PKA RAM */
  CCB_Memcpy_u8_to_u32((__IOM uint32_t *) & (pka_ram_u32[PKA_ECDSA_VERIF_IN_SIGNATURE_S]), p_signature->p_s_sign,
                       p_in_curve_param->prime_order_size_byte);

  /* Move the input parameters hash of message z to PKA RAM */
  CCB_Memcpy_u8_to_u32(&(pka_ram_u32[PKA_ECDSA_VERIF_IN_HASH_E]), p_hash, p_in_curve_param->prime_order_size_byte);

  /* Move the input parameters curve prime order n to PKA RAM */
  CCB_Memcpy_u8_to_u32(&(pka_ram_u32[PKA_ECDSA_VERIF_IN_ORDER_N]), p_in_curve_param->p_prime_order,
                       p_in_curve_param->prime_order_size_byte);

