MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_ccb.c
  /* set the mode and deactivate the interrupts */
  STM32_MODIFY_REG(p_pka_instance->CR,
                   PKA_CR_MODE | PKA_CR_PROCENDIE | PKA_CR_RAMERRIE | PKA_CR_ADDRERRIE | PKA_CR_OPERRIE,
                   CCB_PKA_ECDSA_VERIFICATION_MODE);

  /* Start the computation */
  LL_PKA_Start(p_pka_instance);

  if (CCB_PKA_WaitFlag(p_pka_instance, PKA_SR_PROCENDF) != HAL_OK)
  {
    return HAL_ERROR;
  }

  STM32_SET_BIT(p_pka_instance->CLRFR,
                PKA_CLRFR_PROCENDFC | PKA_CLRFR_RAMERRFC | PKA_CLRFR_ADDRERRFC | PKA_CLRFR_OPERRFC);

  return HAL_OK;
}

/**
  * @brief  Unwraps a software-wrapped key.
  * @param  p_saes_instance     SAES instance
  * @param  p_unwrapkey_context   Pointer to a context structure containing key and algorithm information
  * @retval HAL_OK              Operation completed successfully
  * @retval HAL_ERROR           Error detected during the unwrapping process
  */
static hal_status_t CCB_SAES_SW_UnwrapKey(AES_TypeDef *p_saes_instance, const void *p_unwrapkey_context)
{
  uint32_t tickstart = HAL_GetTick();
  const ccb_sw_unwrap_key_context_t *ctx = (const ccb_sw_unwrap_key_context_t *)p_unwrapkey_context;
  const uint32_t *p_iv = (const uint32_t *)ctx->p_wrapping_key_context->p_init_vect;

  if (CCB_SAES_WaitFlag(p_saes_instance, AES_SR_BUSY, 0U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (ctx->p_wrapping_key_context->aes_algorithm != HAL_CCB_AES_ECB)
  {
    STM32_WRITE_REG(p_saes_instance->CR, AES_CR_KEYSEL_0 | AES_CR_KMOD_0 | AES_CR_KEYSIZE
                    | AES_CR_CHMOD_0);
  }
  else
  {
    STM32_WRITE_REG(p_saes_instance->CR, AES_CR_KEYSEL_0 | AES_CR_KMOD_0 | AES_CR_KEYSIZE);
  }

  /* Wait for Key valid to be 1U */
  if (CCB_SAES_WaitFlag(p_saes_instance, AES_SR_KEYVALID, 1U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Disable the SAES peripheral */
  STM32_CLEAR_BIT(p_saes_instance->CR, AES_CR_EN);

  /* wait for key valid */
  while ((STM32_READ_REG(p_saes_instance->SR) & AES_SR_KEYVALID) == 0U)
  {
    if ((HAL_GetTick() - tickstart) > CCB_GENERAL_TIMEOUT_MS)
    {
      if ((STM32_READ_REG(p_saes_instance->SR) & AES_SR_KEYVALID) == 0U)
      {
        STM32_CLEAR_BIT(p_saes_instance->CR, AES_CR_EN);
        return HAL_ERROR;
      }
    }
  }

  if (CCB_SAES_WaitFlag(p_saes_instance, AES_SR_BUSY, 0U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* set the operating mode and key preparation for decryption, operating mode*/
  STM32_MODIFY_REG(p_saes_instance->CR, AES_CR_KMOD | AES_CR_MODE,
                   AES_CR_KMOD_0 | AES_CR_MODE_0);

  STM32_SET_BIT(p_saes_instance->CR, AES_CR_EN);

  if (CCB_SAES_WaitFlag(p_saes_instance, AES_ISR_CCF, 1U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (CCB_SAES_WaitFlag(p_saes_instance, AES_SR_BUSY, 0U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Return to decryption operating mode(Mode 3)*/
  STM32_MODIFY_REG(p_saes_instance->CR, AES_CR_MODE, AES_CR_MODE_1);

  if (ctx->p_wrapping_key_context->aes_algorithm != HAL_CCB_AES_ECB)
  {
    STM32_WRITE_REG(p_saes_instance->IVR3, p_iv[0]);
    STM32_WRITE_REG(p_saes_instance->IVR2, p_iv[1]);
    STM32_WRITE_REG(p_saes_instance->IVR1, p_iv[2]);
    STM32_WRITE_REG(p_saes_instance->IVR0, p_iv[3]);
  }

  STM32_SET_BIT(p_saes_instance->CR, AES_CR_EN);

  /*
  * Feed the wrapped software key (256-bit) to SAES.
  * ctx->p_in_wrapped_user_key contains 8 words (2 blocks of 128-bit).
  */
  for (uint32_t in_count = 0U; in_count < 8UL; in_count += 4UL)
  {
    for (uint32_t i = 0U; i < 4U; ++i)
    {
      STM32_WRITE_REG(p_saes_instance->DINR, ctx->p_in_wrapped_user_key[in_count + i]);
    }
    /* wait  CCF in SAES */
    if (CCB_SAES_WaitFlag(p_saes_instance, AES_ISR_CCF, 1U) != HAL_OK)
    {
      return HAL_ERROR;
    }
  }

  /* Disable the SAES peripheral */
  STM32_CLEAR_BIT(p_saes_instance->CR, AES_CR_EN);
  STM32_SET_BIT(p_saes_instance->ICR, 0x0EUL);

  return HAL_OK;
}

/**
  * @brief  Generates a buffer of random bytes.
  * @param  p_rng_instance  RNG instance
  * @param  p_randoms       Pointer to store randoms.
  * @retval HAL_OK          Operation completed successfully
  * @retval HAL_ERROR       Error detected
  */
static hal_status_t CCB_RNG_GenerateRandomNumbers(RNG_TypeDef *p_rng_instance, uint16_t *p_randoms)
{
  for (uint8_t i = 0U; i < 3U; ++i)
  {
    uint32_t tickstart = HAL_GetTick();
    while (p_randoms[i] == 0U)
    {
      p_randoms[i] = (uint16_t)(STM32_READ_REG(p_rng_instance->DR) & 0x3FFU);
      if ((HAL_GetTick() - tickstart) > CCB_GENERAL_TIMEOUT_MS)
      {
        if (p_randoms[i] == 0U)
        {
          return HAL_ERROR;
        }
      }
    }
    if (CCB_RNG_WaitFlag(p_rng_instance, RNG_SR_DRDY) != HAL_OK)
    {
      return HAL_ERROR;
    }
  }
  return HAL_OK;
}

/**
  * @brief  Generates a buffer of random bytes.
  * @param  p_rng_instance  RNG instance
  * @param  p_hash          Pointer to store the first random value.
  * @param  hash_size       Specify the size of the hash message
  * @retval HAL_OK          Operation completed successfully
  * @retval HAL_ERROR       Error detected
  */
static hal_status_t CCB_RNG_GenerateHashMessage(RNG_TypeDef *p_rng_instance, uint8_t *p_hash, uint32_t hash_size)
{
  for (uint32_t count = 0U; count < hash_size; count++)
  {
    /* Ensure RNG has fresh data ready */
    if (CCB_RNG_WaitFlag(p_rng_instance, RNG_SR_DRDY) != HAL_OK)
    {
      return HAL_ERROR;
    }

    uint32_t tickstart = HAL_GetTick();
    uint8_t value = 0U;

    while (value == 0U)
    {
      value = (uint8_t)(STM32_READ_REG(p_rng_instance->DR) & 0xFFU);
      if ((HAL_GetTick() - tickstart) > CCB_GENERAL_TIMEOUT_MS)
      {
        if (value == 0U)
        {
          return HAL_ERROR;
        }
      }
    }
    p_hash[count] = value;
  }
  return HAL_OK;
}

/**
  * @brief  Software reset the CCB peripheral.
  * @param  hccb            Pointer to a @ref hal_ccb_handle_t structure
  */
static void CCB_RESET(const hal_ccb_handle_t *hccb)
{
  CCB_TypeDef *p_ccb_instance = CCB_GET_INSTANCE(hccb);

  STM32_SET_BIT(p_ccb_instance->CR, CCB_CR_IPRST);

  (void) CCB_WaitFLAG(p_ccb_instance, CCB_SR_CCB_BUSY);

  STM32_CLEAR_BIT(p_ccb_instance->CR, CCB_CR_IPRST);
}

/**
  * @brief  Pad the end of a buffer with two zero words.
  * @param  p_pka_ram   Pointer to the PKA RAM memory
  * @param  index       Starting index at which to pad zeros
  */
static inline void CCB_PKA_PadEndRam(volatile uint32_t *p_pka_ram, uint32_t index)
{
  p_pka_ram[index] = 0UL;
  p_pka_ram[index + 1U] = 0UL;
}

/**
  * @brief  Get SAES flag.
  * @param  p_saes_instance  SAES instance
  * @param  flag             Specifies the flag to check
  * @retval 1U               Flag is set
  * @retval 0U               Flag is not set
  */
static inline uint32_t CCB_SAES_GetFlag(AES_TypeDef const *p_saes_instance, uint32_t flag)
{
  uint32_t register_value = (flag == (uint32_t)AES_ISR_CCF) ?
                            p_saes_instance->ISR : p_saes_instance->SR;

