MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_ccb.c
  return (STM32_IS_BIT_SET(STM32_READ_REG(register_value), flag)) ? 1U : 0U;
}


/**
  * @brief  Write clear-text data into PKA RAM.
  * @param  p_pka_ram             Pointer to the PKA RAM memory
  * @param  dst_address           Destination address
  * @param  p_src                 Pointer to the source buffer
  * @param  modulus_size_byte     Modulus size in bytes
  * @param  operand_size          Operand size in bytes
  */
static inline void CCB_PKA_WriteClearTextData(volatile uint32_t *p_pka_ram, uint16_t dst_address, const uint8_t *p_src,
                                              uint32_t modulus_size_byte, uint32_t operand_size)
{
  const uint32_t remainder_bytes = (modulus_size_byte) & 7UL;
  const uint32_t max_word_offset = (remainder_bytes != 0U) ? ((operand_size) - 4UL) : ((operand_size) - 2UL);
  uint32_t word_offset;

  for (word_offset = 0U; word_offset < max_word_offset; word_offset += CCB_WORDS_PER_BLOCK)
  {
    const uint32_t src_index = modulus_size_byte - ((word_offset * CCB_BYTES_PER_WORD) + 1U);
    CCB_Memcpy_u8_to_u64(&p_pka_ram[dst_address + word_offset], &p_src[src_index]);
  }

  if (remainder_bytes != 0U)
  {
    const uint32_t src_index = modulus_size_byte - ((word_offset * CCB_BYTES_PER_WORD) + 1U);
    CCB_Memcpy_TailBytesToU64(&p_pka_ram[dst_address + word_offset], &p_src[src_index],
                              remainder_bytes);

    word_offset += CCB_WORDS_PER_BLOCK;
  }

  CCB_PKA_PadEndRam(p_pka_ram, dst_address + word_offset);
}
/**
  * @brief  Write wrapped key into SAES data register.
  * @param  dst_address       Destination address
  * @param  p_wrapped_key     Pointer to wrapped key
  * @param  size_byte         Operand size in bytes
  * @param  randoms           Random Number
  * @retval HAL_OK            Operation is successfully accomplished
  * @retval HAL_ERROR         Error detected during the process
  *
  */
static inline hal_status_t CCB_WriteWrappedKey(uint16_t dst_address, const uint32_t *p_wrapped_key, uint32_t size_byte,
                                               uint32_t randoms)
{
  AES_TypeDef *p_saes_instance = SAES;
  __IOM uint32_t *pka_ram_u32 = (__IOM uint32_t *)PKA->RAM;

  /* Convert the key size in bytes into the number of 32-bit words required by the PKA operand format.*/
  uint32_t operand_size   = 2UL * ((uint32_t)((size_byte + 7UL) >> 3UL) + 1UL);

  /* Derive the number of 32-bit words of actual cipher key to use */
  const uint32_t cipherkey_size = ((operand_size & 3U) != 0U) ? (operand_size - 2U) : operand_size;
  const uint32_t has_remainder  = (operand_size & 3U);
  uint32_t count_block = 0UL;

  for (uint32_t word_offset = 0UL; word_offset < cipherkey_size; word_offset++)
  {
    /* Write encrypted phi in DINR of SAES */
    STM32_WRITE_REG(p_saes_instance->DINR, (p_wrapped_key[cipherkey_size - (word_offset + 1UL)] ^ randoms));

    if ((word_offset & 3UL) == 0x3UL)
    {
      /* Wait until CCF flag is Set in SAES */
      if (CCB_SAES_WaitFlag(p_saes_instance, AES_ISR_CCF, 1U) != HAL_OK)
      {
        return HAL_ERROR;
      }

      /* Write key in PKA RAM */
      for (uint32_t count_ram = 0U; count_ram < 4U; count_ram++)
      {
        pka_ram_u32[dst_address + count_block + count_ram] = CCB_MAGIC_VALUE;

      }
      count_block += 4UL;
    }
  }

  if (has_remainder != 0UL)
  {
    CCB_PKA_PadEndRam(pka_ram_u32, (dst_address + cipherkey_size));
  }

  return HAL_OK;
}

/**
  * @brief  Write CCB key from RNG.
  * @param  dst_address     Destination address
  * @param  operand_size    Operand size in bytes
  * @retval HAL_OK          Operation completed successfully
  * @retval HAL_ERROR       Error detected
  */
static inline hal_status_t CCB_WriteKeyFromRNG(uint16_t dst_address, uint32_t operand_size)
{
  PKA_TypeDef *p_pka_instance = PKA;
  RNG_TypeDef *p_rng_instance = RNG;
  __IOM uint32_t *pka_ram_u32 = (__IOM uint32_t *)p_pka_instance->RAM;
  uint32_t word_offset;

  for (word_offset = 0UL; word_offset < (operand_size - 2UL); word_offset++)
  {
    if (CCB_RNG_WaitFlag(p_rng_instance, RNG_SR_DRDY) != HAL_OK)
    {
      return HAL_ERROR;
    }
    pka_ram_u32[(dst_address + word_offset)] = CCB_MAGIC_VALUE;
  }
  /* Check RNG Error Flag in PKA */
  if (CCB_GET_PKA_FLAG(p_pka_instance, PKA_SR_RNGERRF) != 0U)
  {
    return HAL_ERROR;
  }
  CCB_PKA_PadEndRam(pka_ram_u32, (dst_address + word_offset));

  /* Wait until RNGOKF flag is 1U in PKA and trig OPSTEP transition 0x6 --> 0x8 */
  if (CCB_PKA_WaitFlag(p_pka_instance, PKA_SR_RNGOKF) != HAL_OK)
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Read ciphered private key.
  * @param  dst_address      Destination address
  * @param  operand_size     Operand size in bytes
  * @param  p_wrapped_key    Pointer to wrapped key
  * @param  randoms          Random Number
  * @retval HAL_OK           Operation completed successfully
  * @retval HAL_ERROR        Error detected
  */
static inline hal_status_t CCB_ReadCipheredPrivateKey(uint16_t dst_address, uint32_t operand_size,
                                                      uint32_t *p_wrapped_key, uint32_t randoms)
{
  PKA_TypeDef *p_pka_instance = PKA;
  AES_TypeDef *p_saes_instance = SAES;
  __IOM uint32_t *pka_ram_u32 = (__IOM uint32_t *)p_pka_instance->RAM;
  const uint32_t has_remainder  = (operand_size & 3U);
  const uint32_t cipherkey_size = (has_remainder != 0U) ? (operand_size - 2U) : operand_size;
  uint32_t count_block = 0UL;

  for (uint32_t word_offset = 0U; word_offset < cipherkey_size; word_offset++)
  {
    pka_ram_u32[dst_address + word_offset] = CCB_MAGIC_VALUE;
    if ((word_offset & 3UL) == 3UL)
    {
      /* Wait until CCF flag is 1U in SAES*/
      if (CCB_SAES_WaitFlag(p_saes_instance, AES_ISR_CCF, 1U) != HAL_OK)
      {
        return HAL_ERROR;
      }

      /* Read ciphered private Key*/
      for (uint16_t count = 0U; count < CCB_BLOCK_SIZE_WORD ; count++)
      {
        p_wrapped_key[cipherkey_size - (count_block + count + 1UL)]
          = (STM32_READ_REG(p_saes_instance->DOUTR) ^ randoms);
      }
      count_block += 4UL;
    }
  }

  if (CCB_SAES_WaitFlag(p_saes_instance, AES_SR_BUSY, 0U) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (has_remainder != 0UL)
  {
    CCB_PKA_PadEndRam(pka_ram_u32, (dst_address + cipherkey_size));
  }

