MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_ccb.c
  /* Wait until DATAOKF flag is 1U in PKA and trig OPSTEP transition 0x08 --> 0x09 */
  if (CCB_PKA_WaitFlag(p_pka_instance, PKA_SR_DATAOKF) != HAL_OK)
  {
    return HAL_ERROR;
  }
  return HAL_OK;
}

/**
  * @brief  Erase Pool Buffer.
  * @param  p_buff           Pool buffer
  * @param  buff_size_byte   Pool buffer size in byte
  */
static void CCB_ErasePoolBuffer(uint8_t *p_buff, uint32_t buff_size_byte)
{
  volatile uint32_t *p_buffer_32 = (volatile uint32_t *)p_buff;
  uint32_t words = buff_size_byte / 4U;
  uint32_t tail = buff_size_byte & 0x3U;

  for (uint32_t i = 0U; i < words; i++)
  {
    p_buffer_32[i] = 0U;
  }

  for (uint32_t i = 0U; i < tail; i++)
  {
    p_buff[(words * 4U) + i] = 0U;
  }
}

#if defined (USE_HAL_CCB_RNG_RECOVERY) && (USE_HAL_CCB_RNG_RECOVERY == 1U)
#if defined(RNG_HTSR0_RPERRX) || defined(RNG_HTSR1_ADERRX)
/**
  * @brief  RNG sequence to resilient recover from a seed error.
  * @retval HAL status
  */
hal_status_t CCB_RNG_ResilientRecoverSeedError(void)
{
  RNG_TypeDef *p_rng_instance = RNG;

  uint32_t timeout;
  uint32_t htsr_temp = 0U;
  uint32_t htsr_previous_temp = 0U;
  uint32_t htsr_count = 0U;
  uint32_t nsmr_temp = 0U;
  uint32_t tickstart1 = 0U;
  uint32_t tickstart2 = 0U;
  uint32_t tickstart3 = 0U;
  uint32_t oscillators_count = 0U;
  uint32_t config_b_fewer_than_6_osc_count = 0U;
  uint8_t count = 0U;

  /* timeout here is an emperic value */
  timeout = (1UL + ((1UL << (STM32_READ_BIT(p_rng_instance->CR, RNG_CR_CLKDIV) >> 16UL))
                    * CCB_RNG_TIMEOUT_VALUE / 8UL));
  LL_RNG_Enable(RNG);

  tickstart1 = HAL_GetTick();

  /* Check if seed error current status indicates no error and auto-reset succeeded */
  if (LL_RNG_IsActiveFlag_SECS(RNG) == 0U)
  {
    /* Clear SEIS flag when automatic reset is activated */
    LL_RNG_ClearFlag_SEIS(RNG);
  }

  else  /* Sequence to fully recover from a seed error*/
  {
    if (LL_RNG_IsConfigLocked(RNG) == 0U)
    {
      do
      {
        if (LL_RNG_IsActiveFlag_SECS(RNG) == 0U)
        {
          break;
        }
        /* Read oscillator status registers combined */
        htsr_temp = LL_RNG_GetHealthTestStatus(RNG, 0U);
        htsr_temp |= LL_RNG_GetHealthTestStatus(RNG, 1U);
        if (htsr_temp > 0U)
        {
          /* If any oscillator status bits overlap with previous status, increment counter */
          if ((htsr_temp & htsr_previous_temp) != 0U)
          {
            htsr_count++;
          }

          if (htsr_count > 3U)
          {
            /* if the same repetitive or adaptative error is detected 3 times */
            nsmr_temp = LL_RNG_GetNoiseSourceMask(RNG);

            /* deactivate the same osc in each triple oscillator (Mask oscillators with the seed error by
            clearing bits shifted right by 1) */
            nsmr_temp = nsmr_temp & ~(htsr_temp >> 1U);

            /* Count the number of active oscillators in nsmr */
            oscillators_count = 0U;
            for (count = 0U; count < 9U; count++)
            {
              if (((nsmr_temp >> count) & 0x1U) != 0U)
              {
                /* increment count1 for each 1 in nsmr */
                oscillators_count++;
              }
            }

            if (oscillators_count < 6U)
            {
              /* If fewer than 6 oscillators remain active, unmask all oscillators --> Reset masking */
              nsmr_temp = LL_RNG_GetOscNoiseSrc(RNG, LL_RNG_NOISE_SRC_1 | LL_RNG_NOISE_SRC_2 | LL_RNG_NOISE_SRC_3);
              htsr_previous_temp = 0;
              htsr_count = 0U;
              if ((RNG->CR  & RNG_CR_CLKDIV_Msk) < ((uint32_t)RNG_CAND_NIST_CR_VALUE & RNG_CR_CLKDIV_Msk))
              {
                config_b_fewer_than_6_osc_count++;
              }
            }

            if (config_b_fewer_than_6_osc_count > 2U)
            {
              /* Reset RNG condition */
              STM32_WRITE_REG(p_rng_instance->CR, (RNG_CR_CONDRST_Msk | (uint32_t)RNG_CAND_NIST_CR_VALUE));

              /* Update mask register with new oscillator mask */
              LL_RNG_SetNoiseSourceMask(RNG, nsmr_temp);

              /* Clear condition reset bit to resume operation */
              LL_RNG_DisableCondReset(RNG);
            }

            else
            {
              /* Reset RNG condition */
              STM32_WRITE_REG(p_rng_instance->CR,
                              (p_rng_instance->CR & ~RNG_CR_RNGEN_Msk) | RNG_CR_CONDRST_Msk);

              /* Update mask register with new oscillator mask */
              LL_RNG_SetNoiseSourceMask(RNG, nsmr_temp);

              /* Clear condition reset bit to resume operation */
              LL_RNG_DisableCondReset(RNG);
            }
          }

          else
          {
            /* Briefly toggle conditional reset to recover RNG */
            STM32_WRITE_REG(p_rng_instance->CR, (p_rng_instance->CR & ~RNG_CR_RNGEN_Msk) | RNG_CR_CONDRST_Msk);

            /* unmask all oscillators to find another working condition */
            LL_RNG_SetNoiseSourceMask(RNG, LL_RNG_GetOscNoiseSrc(RNG, LL_RNG_OSC_1 | LL_RNG_OSC_2 | LL_RNG_OSC_3));
            LL_RNG_DisableCondReset(RNG);
          }

          /* Wait until RNG is not busy */
          tickstart2 = HAL_GetTick();
          do
          {
            if ((HAL_GetTick() - tickstart2) > CCB_RNG_TIMEOUT_VALUE)
            {
              /* New check to avoid false timeout detection in case of preemption */
              LL_RNG_Disable(RNG);
              return HAL_ERROR;
            }
          } while (STM32_IS_BIT_SET(p_rng_instance->CR, RNG_SR_BUSY));

          /* No timeout --> Enable RNG */
          LL_RNG_Enable(RNG);
          tickstart3 = HAL_GetTick();
          do
          {
            if (LL_RNG_IsActiveFlag_DRDY(RNG) != 0UL)
            {
              break;
            }
            if ((HAL_GetTick() - tickstart3) > timeout)
            {
              /* New check to avoid false timeout detection in case of preemption */
              if (LL_RNG_IsActiveFlag_DRDY(RNG) == 0UL)
              {
                if (LL_RNG_IsActiveFlag_SECS(RNG) == 0UL)
                {
                  LL_RNG_Disable(RNG);
                  return HAL_ERROR;
                }
              }
            }
          } while (LL_RNG_IsActiveFlag_SECS(RNG) == 0UL);

          /* Accumulate seed error status bits */
          htsr_previous_temp = htsr_previous_temp | htsr_temp;
        }
      } while ((HAL_GetTick() - tickstart1) <= timeout);
    }
  }

  /*Check if seed error current status (SECS)is set */
  if (LL_RNG_IsActiveFlag_SECS(RNG) != 0U)
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}
#endif /* RNG_HTSR0_RPERRX || RNG_HTSR1_ADERRX */
#endif /* USE_HAL_CCB_RNG_RECOVERY */
/**
  * @}
  */

#endif /* USE_HAL_CCB_MODULE */
/**
  * @}
  */
#endif /* CCB */
/**
  * @}
  */
